from .params import *
scene_dir = [
	'24-vsパメラ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : vsパメラ'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['006', bat,[]],
	
	['005', a, [
	'ふっ、ザコども、死ね！',
	]],
	
	['076', bat,[]],
	['086', bat,[]],
	
	['095', a, [
	'ば、ばかな・・・',
	]],
	
	['', a, [
	'レヴィンvsパメラ',
	]],
	['013', a, [
	'これはレヴィン王子、お久しぶりです',

	'マーニャは私が片付けて差し上げましたよ',
	'ほほほ・・・',
	]],
	['024', a, [
	'くっ、パメラ！！',
	'きさまというヤツは・・・',
	]],
	['033', a, [
	'ふっ、これもすべて、レヴィン様がお悪いのです・・・',
	]],
	
	['', a, [
	'フュリーvsパメラ',
	]],
	['043', a, [
	'あら、おまえはフュリーだね',
	'帰っていたのかい',
	]],
	['044', a, [
	'パメラ！！',
	'よくもお姉さまを・・・許さないわ！',
	]],
	['053', a, [
	'ふんっ、ヒヨッコが生意気言うんじゃないよ！',

	'おまえもマーニャのもとへ送ってやるよ',
	'覚悟するんだね！！',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
