from .params import *
scene_dir = [
	'12-vsマイオス/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsマイオス'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['006', bat,[]],

	['005', a, [
	'反逆者どもめ！',
	'その首、グランベルに差し出してくれるわ！',
	]],
	['016', bat,[]],
	['036', bat,[]],
	['045', a, [
	'くっ・・・そんなバカな・・・',
	]],
	
	['', a, [
		'レヴィンvsマイオス',
	]],
	['023', a, [
	'けっ、誰かと思ったらラーナのバカ息子か',
	'貴様、帰ってきたのだな',
	]],
	['024', a, [
	'おじ上には悪いが、死んでもらう',
	'これもシレジアを守るためだ',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
