from .params import *
scene_dir = [
	'32-vsダッカー/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : vsダッカー'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['026', bat,[]],
	
	#['025', a, [
	['055', a, [
	'シレジアの王座は、私にこそふさわしいのだ！',
	'貴様らに邪魔はさせぬわ！',
	]],
	
	['036', bat,[]],
	['046', bat,[]],
	
	['055', a, [
	'うう・・・我が野望も、これまでか・・・',
	]],
	
	['', a, [
	'レヴィンvsダッカー',
	]],
	
	['003', a, [
	'くっ・・・レヴィン・・・きさま・・・'
	]],
	['004', a, [
	'ダッカー！　よくもマーニャを！！',
	'貴様だけは、ただでは殺さん！',
	]],
	['013', a, [
	'何を生意気な！　死ねっ、レヴィン！',
	]],

	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
