from .params import *
scene_dir = [
	'10-桟橋を上げる/',
	'11-桟橋解除/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : 桟橋'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['', a, [
	'トーヴェ城接近時',
	]],
	['002', a, [
	'なにぃ、セイレーンの反逆者どもが、',
	'このトーヴェに迫ってきただと',
	'',
	'おい、トーヴェ河のはね橋をあげてこい',

	'ふふふ、',
	'このカギがなければ橋は通れないからな',
	'ヤツらのおどろく顔が見えるようだ',
	]],
	['020', fld,[]],
	['030', fld,[]],

	['', a, [
	'デューで解除',
	]],
	['040', fld,[]],
	['054', a, [
	'なんだい、こんなカギ',
	'おいらがちょちょいのちょいと・・・ほらね',
	]],
	['060', fld,[]],
	
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
