from .params import *
scene_dir = [
	'81-シグルド軍',
	#'82-マイオス軍',
	#'83-ディートバ軍',
	#'84-トーヴェ軍1',
	#'84-トーヴェ軍2',
	#'84-トーヴェ軍3',
	#'84-トーヴェ軍4',
	'85-クブリ軍',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsクブリ軍' 

persons = {
	'シグルド'  : '00',
	'クブリ'  : '20',
}

organization = {
	'左' : {
		'名' : 'シグルド軍(20)',
		'指揮官' : persons['シグルド'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10,11,12]],
			['', [13,14,15,16]],
			['', [17,18,19]],
		],
	},
	'右' : {
		'名' : 'クブリ軍(11)',
		'指揮官' : persons['クブリ'],
		'編成' : [
			['マージ(10)', [22,23,24,25,26,27,28,28]],
			['', [29,30]],
			
		],
	},
}
