from .params import *
scene_dir = [
	'81-シグルド軍',
	'82-マイオス軍',
	#'83-ディートバ軍',
	'84-トーヴェ軍1',
	'84-トーヴェ軍2',
	'84-トーヴェ軍3',
	'84-トーヴェ軍4',
	#'85-クブリ軍',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsマイオス軍' 

persons = {
	'シグルド'  : '00',
	'マイオス'  : '20',
}

organization = {
	'左' : {
		'名' : 'シグルド軍',
		'指揮官' : persons['シグルド'],
		'編成' : [
			['', [2,3,4,5]],
			['', [6,7,8,9]],
			['', [10,11,12,13]],
			['', [14,15,16,17]],
			['', [18,19]],
		],
	},
	'右' : {
		'名' : 'マイオス軍(44)',
		'指揮官' : persons['マイオス'],
		'編成' : [
			['ウィンドマージ(3)', [21,22,23]],
			['アーマー(7)', [24,25,26,27,28,29,30]],
			['マージファイター(隊長)', [31]],
			['ウィンドマージ(2)', [32,33]],
			['ウィンドマージ(隊長)', [34]],
			['ソードファイター(2)', [35,36]],
			['ウィンドマージ(孤軍)', [37]],
			['パイレーツ(6)', [38,39,40,41,42,43]],
			
		],
	},
}
