from .params import *
scene_dir = [
	'81-シグルド軍',
	#'86-ダッカー軍',
	'91-レイミア軍',
	#'92-シビリアン',
	#'93-市民追討',
	#'94-ドノバン軍',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : vsレイミア軍' 

persons = {
	'シグルド'  : '00',
	'レイミア'  : '20',
}

organization = {
	'左' : {
		'名' : 'シグルド軍',
		'指揮官' : persons['シグルド'],
		'編成' : [
			['', [2,3,4,5]],
			['', [6,7,8,9]],
			['', [10,11,12,13]],
			['', [14,15,16,17]],
			['', [18,19]],
		],
	},
	'右' : {
		'名' : 'レイミア軍(10)',
		'指揮官' : persons['レイミア'],
		'編成' : [
			['ソードファイター(4)', [21,22,23,24]],
			['サンダーマージ(2)', [25,26]],
			['ボウファイター(2)', [27,28]],
			['プリースト(1)', [29]],
		],
	},
}
