from .params import *
scene_dir = [
	'00-プロローグ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]
#files = []

org_im = [14]

title = 'プロローグ'
a = 0.5

scene = [ 
	['00', a, [
	'思いもよらぬ出来事で、',
	'愛する祖国から、',
	'反逆者の汚名をきせられたシグルドは、',
	]],
	['01', a, [
	'失意の中、',
	'北辺の独立国シレジアへと落ちのびた。',
	]],
	['02', a, [
	'風の聖戦士セティによって',
	'建国されたシレジア王国は、',
	
	'勇猛なる天馬騎士団と',
	'風の魔道士たちに守られ、',
	'建国以来　百年間、',
	'他国に侵略される事もなく、',
	
	'完全な中立を保ってきた。',
	]],
	['05', a, [
	'しかし、数年前に国王が亡くなると、',
	'跡目をめぐって王族内で対立がおこり、',
	]],
	['06', a, [
	'平和だったこの国にも',
	'にわかに戦乱のきざしがみえてきた。',
	]],
	['07', a, [
	'先王には王妃ラーナとの間に',
	'レヴィンという王子がいたが、',
	]],
	['08', a, [
	'野心あふれる王弟ダッカー公は、',
	'レヴィンの王位継承を不服として',
	'ザクソン城にたてこもり、',
	
	'また、これに呼応するかのように、',
	]],
	['10', a, [
	'末弟のマイオス公爵も',
	'トーヴェの城に兵を集めだした。',
	]],
	['11', a, [
	'このような状況の中で、',
	'レヴィン王子は',
	'やむなく国を出たのだったが、',
	
	'王族達の野望は留まるところをしらず、',
	'シレジアの美しい大地は、今まさに、',

	'戦乱の炎によって',
	'焼き尽くされようとしていた。',
	]],
	
	['14', a, []],
	
	#['改ページ', -1, ['']],
	
	
]


