from .params import *
scene_dir = [
	'17-vsディスラー/',
	
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsディスラー'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['006', bat,[]],
	
	['005', a, [
	'なに・・・反乱軍か！？',
	'くそ、油断したわ！',
	]],
	
	['016', bat,[]],
	['026', bat,[]],
	['036', bat,[]],
	
	['045', a, [
	'トラバント様・・・・',
	'・・・・おゆるしを・・・',
	]],

	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
