from .params import *
scene_dir = [
	'24-vsジュダ/',
	
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : vsジュダ'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['006', bat,[]],
	
	['005', a, [
	'おのれ・・・なにが解放軍だ・・・',
	'この世に光など必要ない',

	'ロプトウス様の闇が、全てを支配するのだ！',
	]],
	
	['026', bat,[]],
	['036', bat,[]],
	['046', bat,[]],
	['056', bat,[]],
	
	['065', a, [
	'ふはは・・・',
	'ロプトウス様が復活なされば',
	'・・・お前らなど・・・',
	]],
	


	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
