from .params import *
scene_dir = [
	'32-vsアリオーン/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : vsアリオーン'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['', a, [
		'アリオーンに接近',
	]],
	['004', a, [
	'来たか・・・よし、行くぞ！',
	'勝利か、それとも死か・・・',
	'それはおまえたちの戦い方しだいだ！',
	
	'全軍、敵に突入せよ！！',
	]],
	
	['', a, [
		'vsアリオーン',
	]],
	
	['076', bat,[]],
	['075', a, [
	'ふっ・・・おろかな・・・',
	'この天槍グングニルが、目に入らないと見える・・・',
	]],
	
	['086', bat,[]],
	['096', bat,[]],
	['106', bat,[]],
	['116', bat,[]],
	['126', bat,[]],
	
	['135', a, [
	'な、なに・・・そんなことが・・・',
	'くっ、無念だ・・・アルテナ・・・',
	
	'',
	'(いのりのリング)',
	]],
	
	['', a, [
		'アルテナvsアリオーン',
	]],
	['023', a, [
	'兄上、もう止めてください',
	'こんな戦いに何の意味があるのです！',
	]],
	['024', a, [
	'アルテナか・・・元気そうだな',
	'お前と戦えるなら私も本望だ',
	'手加減はしないぞ',
	
	'さあ、かかってこい！！',
	]],
	['043', a, [
	'兄上・・・',
	]],
	
	['', a, [
		'セリスvsアリオーン',
	]],
	['053', a, [
	'お前がセリス皇子か',
	'うむ、相手にとって不足はない',
	'お手合わせ願おうか・・・',
	]],
	['054', a, [
	'アリオーン王子！',
	'あなたはまだわからないのか！！',
	]],
	['063', a, [
	'もう何も言うな！',
	'いくぞ、セリス',
	'このグングニルを受けてみよ！',
	]],
	
	['', a, [
		'アリオーン撃破後',
	]],
	
	['150', fld,[]],
	['160', fld,[]],
	
	['174', a, [
	'アリオーン、',
	'まだ死なせるわけにはいかぬ・・・',
	'私のもとにこい・・・はっはっはっ・・・',
	]],
	
	['180', fld,[]],
	['190', fld,[]],
	['200', fld,[]],
	['210', fld,[]],

	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
