from .params import *
scene_dir = [
	'26-vsムーサ/',
	
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : vsムーサ'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['006', bat,[]],
	
	['005', a, [
	'死ね、反乱軍ども！',
	'帝国に逆らう者は、死あるのみだ！',
	]],
	
	['016', bat,[]],
	['026', bat,[]],
	['036', bat,[]],
	['046', bat,[]],
	
	['055', a, [
	'グランベル帝国・・・ばんざい！',
	]],
	

	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
