from .params import *
scene_dir = [
	'12-vsトラバント/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsトラバント'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['', a, [
	'vsトラバント',
	]],
	['076', bat,[]],
	
	['085', a, [
	'はっはっは、反乱軍の雑魚どもよ',
	'わしがトラバントだ',
	
	'冥土のみやげに、よく覚えておけよ！',
	]],
	
	['096', bat,[]],
	['106', bat,[]],
	
	['115', a, [
	'トラキアよ・・・',
	'わが愛しき大地よ・・・ぐふっ',
	]],
	
	
	['改ページ', -1, ['']],
	
	['', a, [
	'フィンvsトラバント',
	]],
	
	['003', a, [
	'貴様はフィンか、久しぶりだな',
	'まだしぶとく生きていたか',
	]],
	['004', a, [
	'トラバント王、わが主君の恨み、',
	'今日こそ晴らさせてもらうぞ！',
	]],
	['013', a, [
	'はっはっは、笑わせるな',
	'貴様のような雑魚に何ができる！',
	'死ぬのは貴様の方だ！！',
	]],
	
	
	['', a, [
	'リーフvsトラバント',
	]],
	
	['023', a, [
	'ククク・・・',
	'貴様がキュアンの小せがれか',
	
	'ブルームも間抜けな男よ',
	'さっさと殺しておけばよいものを',
	]],
	['034', a, [
	'トラバント、やっと巡り会えた・・・',
	'私は・・・この日が来るのを、',
	'どんなに待ち望んだことか・・・',
	
	'貴様をこの手で殺すことを夢見て、',
	'私は生きてきたのだ！！',
	]],
	['053', a, [
	'ふっ・・・愚かな・・・',
	'ゲイボルグも使えぬお前に、このわしが倒せるものか！',
	
	'死ねっ小僧！',
	'お前もキュアンと同じようにな！',
	]],
	
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
