from .params import *
scene_dir = [
	'10-vsアルテナ/',
	'11-ハンニバル進軍開始/',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsアルテナ'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['', a, [
	'vsアルテナ',
	]],
	['006', bat,[]],
	
	['005', a, [
	'やめろ！',
	'お前などにこの私は倒せない！',
	]],
	
	['', a, [
	'アルテナ撃破時',
	]],
	['016', bat,[]],
	['046', bat,[]],
	
	['055', a, [
	'兄上・・・アリオーン兄様・・・',
	]],
	
	['改ページ', -1, ['']],
	
	['', a, [
	'リーフvsアルテナ',
	]],
	['023', a, [
	'お前はレンスターの王子だな',
	'我が国を奪うつもりか！',
	]],
	['024', a, [
	'ま、待って下さい！',
	'貴女と私は・・・',
	]],
	['033', a, [
	'言うな！戦場に戯れ言は無用！！',
	'',
	]],
	
	['', a, [
	'フィンvsアルテナ',
	]],
	['063', a, [
	'悪いが死んでもらう、許せよ・・・',
	]],
	['064', a, [
	'！・・・ア、アルテナ様・・・！？',
	'やはりあなたは・・・',
	]],
	
	['', a, [
		'会話：リーフ→アルテナ',
	]],
	
	['073', a, [
	'待って下さい！　姉上！！',
	]],
	['074', a, [
	'姉上だと！？　・・・おまえは誰だ！',
	'なぜ私を姉と呼ぶ！',
	]],
	['083', a, [
	'私は・・・レンスターのリーフです',
	]],
	['084', a, [
	'リーフ？　そうか、',
	'おまえがレンスターの王子なのだな',

	'私はトラバントの娘、アルテナだ',
	'寝ぼけてもらっては困るな',
	]],
	['103', a, [
	'あなたはわが両親、キュアンとエスリンの子だ',
	'十七年前、二人はトラバントに殺された',
	
	'幼かった私の姉は、',
	'レンスターの家宝ゲイボルグと共に行方不明になった',
	
	'あなたが手にしているその槍、',
	'それこそがレンスターのゲイボルグです',
	]],
	['124', a, [
	'なんだと！？ ',

	'では、私が父だと信じていた人は、',
	'実の父のかたきだったと言うのか・・・',
	'まさか・・・そんな・・・',
	]],
	['143', a, [
	'私を見て下さい',
	'私が言ったことがウソかどうかは、',
	'見ていただけばわかるはず',
	
	'姉上、どうか・・・',
	]],
	['154', a, [
	'くっ・・・なぜだ！？',
	'なぜおまえの言葉をウソだと言いきれない！！',
	]],
	['163', a, [
	'姉上・・・！！',
	]],
	['164', a, [
	'待て！　・・・父上に確かめてくる',
	'すべてはそれからだ！！',
	]],
	
	['改ページ', -1, ['']],
	
	['170', fld,[]],
	['180', fld,[]],
	['190', fld,[]],
	
	['201', a, [
	'アルテナ、一体なんのつもりだ',
	'またもや部下達を置き去りにして、',
	'一人で逃げ帰ってくるとは！',
	]],
	['202', a, [
	'父上！　お聞きしたいことがあります',
	'私が父上の娘ではないというのは、本当ですか！？',
	
	'私はキュアン王の娘なのですか！',
	]],
	['221', a, [
	'フッ・・・ついに知ったか',
	'まあ、よかろう',
	'いずれこんな日もくると思っていた',
	'',
	
	'確かにおまえはキュアンの娘だ',
	'だがな、それが何だというのだ',

	'お前を育ててやったのは、このわしだ',
	'その事実に変わりはあるまい',
	]],
	['242', a, [
	'・・・では、私の本当の両親は、父上、あなたが・・・',
	]],
	['251', a, [
	'ふふふ、そうだ、おまえの両親、',
	'キュアンとエスリンはわしが殺した',
	'しかし、それがどうしたというのだ？',
	
	'戦争とは殺し殺されるもの',
	'いまさらそんなことを言っても始まるまい',
	]],
	['262', a, [
	'くっ・・・',
	'ゆるせない、私をだまして・・・',
	'父上！　・・・いや、トラバント！！',
	]],
	['271', a, [
	'よせ！　アルテナ！',
	]],
	['272', a, [
	'兄上！　止めるな！',
	'私はこの男を殺す',
	'誰にも邪魔はさせない！',
	]],
	['281', a, [
	'そうはいかない！',
	'父上に刃向かうなら、この私が相手になる！',
	]],
	['282', a, [
	'ま、待て！',
	'私は兄上とは戦えない！！',
	]],
	['291', a, [
	'もはや遅いな・・・',
	'死ねっ、アルテナ！',
	]],
	['292', a, [
	'あ、兄上・・・・・',
	]],
	
	['', a, [
	'',
	]],
	
	
	['302', a, [
	'・・・アリオーン',
	'アルテナを殺したのか？',
	'なにもそこまでせずともよかろうに・・・',
	
	'まあ、よい',
	'アリオーンよ、こうなればわしが出る',
	'もはやそれしかあるまい',
	
	'城の守りはおまえに頼む',
	]],
	['331', a, [
	'おまかせください、父上',
	]],
	['332', a, [
	'おまえには、この槍を預けておく',
	'よいな、トラキアを守るのだ',
	]],
	['341', a, [
	'父上、これはグングニルの槍ではありませんか',

	'これから出陣されようかというときに、どうしてこれを？',
	'まさか・・・父上？',
	]],
	['352', a, [
	'もういい、わしは疲れたのだ',
	'あとはおまえの好きにせよ',
	'おまえならば、奴らも憎んではおらぬ',
	]],
	['361', a, [
	'彼らと休戦せよと？',
	'それは同意しかねます！',
	]],
	['362', a, [
	'だから好きにせよと言っている',
	'ただし、民をこれ以上、苦しめるな',
	'わしの願いはそれだけだ',
	
	'では、さらばだ、アリオーン！',
	]],
	['382', a, [
	'',
	]],
	['381', a, [
	'父上・・・',
	]],
	
	['390', fld,[]],
	
	
	['', a, [
	'ハンニバル進軍開始',
	]],
	['404', a, [
	'そうか、トラバント王が出陣されたか・・・',
	'わしも武人、もはや・・・止むを得まい・・・',
	
	'全軍突撃せよ、侵略者を打ち払え！！',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
