from .params import *
scene_dir = [
	'13-トラバントの死/',
	'16-セリス-アルテナ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : トラバントの死'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['', a, [
	'トラバントの死',
	]],
	
	['001', a, [
	'アルテナ、大丈夫か！',
	]],
	['002', a, [
	'！・・・・・・あ、兄上・・・',
	]],
	['011', a, [
	'すまなかった',
	'お前に斬りつけるフリをして、当て身をくらわせた',
	
	'あの時は、そうするしかなかったのだ',
	]],
	['022', a, [
	'兄上・・・わかっています',
	'でも、父上・・・いえ、トラバント王は？',
	]],
	['031', a, [
	'戦死された',
	'もはや戻ってはこられぬつもりだったのだろう',
	]],
	['032', a, [
	'え？・・・それはどういうことですか？',
	]],
	['041', a, [
	'お前は聞かぬ方がよい',
	'お前には・・・父上の心はわからぬ・・・',
	]],
	['042', a, [
	'・・・兄上、',
	'私はこれからどうすればよいのでしょう',
	]],
	['051', a, [
	'リーフ王子が待っているのであろう',
	'彼のもとに行ってやれ',
	]],
	['052', a, [
	'でも、それでは兄上は・・・',
	]],
	['061', a, [
	'アルテナ・・・',
	'これも運命だ、仕方あるまい',
	]],
	['062', a, [
	'兄上、休戦しましょう',
	'トラバント王が亡くなったのなら、',
	'もう何の障害も無いはずです',
	
	'私は兄上と戦うなんてイヤです！',
	]],
	['081', a, [
	'父上の最後の言葉を聞かなければ、',
	'私もそうしていたさ・・・',
	'',
	'もういい、アルテナ、行け！',
	
	'今度会うときは戦場だ',
	'その時は私も手加減はしない',
	'覚悟しておけ、アルテナ！',
	]],
	['092', a, [
	'兄上・・・',
	]],
	
	['100', fld,[]],
	
	#['改ページ', -1, ['']],
	
	['', a, [
	'セリス←→アルテナ',
	]],
	
	['113', a, [
	'セリス様、',
	'私はレンスターのキュアンの娘、アルテナです',
	
	'弟のリーフ王子から真実を聞かされて、',
	'もはやあなた達とは戦えなくなりました',
	'どうか私も解放軍の一員にお加え下さい',
	]],
	['124', a, [
	'アルテナ王女！？',
	'ああっ、あなたが、リーフ王子の姉上なのですね！',
	
	'彼から話をきいて待っていたのです',
	'ありがとう、王子もきっと喜ぶことでしょう',
	
	'よく決心して下さいました',
	]],
	['153', a, [
	'・・・まだ信じられないほどです',
	'でも、リーフ王子の目を見たときに全てを悟りました',
	
	'あれは、やさしかった父の眼差し・・・',

	'そして、母の腕に抱かれていた、',
	'少女のころの記憶がハッキリとよみがえってきました',
	]],
	['174', a, [
	'でも、トラバント王は、',
	'いったい、どういうつもりだったのでしょう',

	'ご両親を殺しておきながら、',
	'まだ幼かったあなたを国に連れ帰るなんて・・・',
	]],
	['193', a, [
	'兄には、',
	'ゲイボルグの槍を自分のために使いたかったのだと、',
	'言っていたそうです',
	
	'そのために私を・・・',
	]],
	['204', a, [
	'利用しただけだと？',
	]],
	['213', a, [
	'それは・・・私にもわかりません',
	'トラバントは恐ろしい男ですが、',
	'私は父親だと信じていました・・・',
	]],
	['214', a, [
	'トラバント王・・・',
	'よくわからない人ですね',
	]],
	['223', a, [
	'セリス様、お願いがあります',
	'アリオーンは・・・アリオーン王子だけは、',
	'助けてほしいのです',
	]],
	['224', a, [
	'ええ、王子は立派な人だと聞いています',
	'私も戦いたくはありません',
	'でも、彼は聞いてくれるでしょうか',
	]],
	['233', a, [
	'私がもう一度、説得してみます',
	'だから、もう少しだけ時間を下さい！',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
