from .params import *
scene_dir = [
	#'81-セリス軍',
	#'87-アルテナ',
	#'88-コープル',
	#'89-ハンニバル',
	
	'81a-セリス軍',
	'87-アルテナ',
	'88a-シャルロー',
	'89-ハンニバル',
	
	'92-アリオーン軍',
	'93-3頭の竜1',
	'93-3頭の竜2',
	'93-3頭の竜3',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

#title = 'Phase3 : vsアリオーン軍' 
title = 'Phase3(平民) : vsアリオーン軍' 

persons = {
	'セリス'  : '00',
	'アリオーン'  : '24',
}

organization = {
	'左' : {
		'名' : 'セリス軍(24)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10,11,12]],
			['', [13,14,15,16]],
			['', [16,17,18,19]],
			['', [20,21,22,23]],
		],
	},
	'右' : {
		'名' : 'アリオーン軍(49)',
		'指揮官' : persons['アリオーン'],
		'編成' : [
			['ドラゴンナイト(16)', [25,26,27,28,29,30,31,32]],
			['', [33,34,35,36,37,38,39,40]],
			['ドラゴンナイト(1)x3', [41,51,61]],
			['ドラゴンライダー(9)x3', [42,43,44,45,46,47,48,49]],
			['', [50]],
			['', [52,53,54,55,56,57,58,59]],
			['', [60]],
			['', [62,63,64,65,66,67,68,69]],
			['', [70]],
		],
	},
}
