from .params import *
scene_dir = [
	'81-セリス軍',
	#'81a-セリス軍',
	
	#'82-アルテナ軍',
	'84-ディスラー',
	#'85-トラバント軍',
	#'86-ハンニバル軍',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsディスラー軍' 
#title = 'Phase1(平民) : vsディスラー軍' 

persons = {
	'セリス'  : '00',
	'ディスラー'  : '21',
}

organization = {
	'左' : {
		'名' : 'セリス軍(21)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10,11,12]],
			['', [13,14,15,16]],
			['', [16,17,18,19]],
			['', [20]],
		],
	},
	'右' : {
		'名' : 'ディスラー軍(5)',
		'指揮官' : persons['ディスラー'],
		'編成' : [
			['マウンテンシーフ(1)', [22]],
			['フォーレスト(3)', [23,24,25]],
			
		],
	},
}
