from .params import *
scene_dir = [
	'81-セリス軍',
	'87-アルテナ',
	'88-コープル',
	'89-ハンニバル',
	
	#'81a-セリス軍',
	#'87-アルテナ',
	#'88a-シャルロー',
	#'89-ハンニバル',
	
	#'90-グルティア軍',
	'91-ムーサー軍',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : vsムーサー軍' 
#title = 'Phase2(平民) : vsムーサー軍' 

persons = {
	'セリス'  : '00',
	'ムーサー'  : '24',
}

organization = {
	'左' : {
		'名' : 'セリス軍(24)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10,11,12]],
			['', [13,14,15,16]],
			['', [16,17,18,19]],
			['', [20,21,22,23]],
		],
	},
	'右' : {
		'名' : 'ムーサー軍(12)',
		'指揮官' : persons['ムーサー'],
		'編成' : [
			['フォレストナイト(3)', [25,26,27]],
			['デュークナイト(3)', [28,29,30]],
			['パラディン(2)', [31,32]],
			['グレートナイト(3)', [33,34,35]],
		],
	},
}
