from .params import *
scene_dir = [
	#'81-セリス軍',
	#'87-アルテナ',
	#'88-コープル',
	#'89-ハンニバル',
	
	'81a-セリス軍',
	'87-アルテナ',
	'88a-シャルロー',
	'89-ハンニバル',
	
	'90-グルティア軍',
	#'91-ムーサー軍',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

#title = 'Phase2 : vsグルティア軍' 
title = 'Phase2(平民) : vsグルティア軍' 

persons = {
	'セリス'  : '00',
	'ジュダ'  : '24',
}

organization = {
	'左' : {
		'名' : 'セリス軍(24)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10,11,12]],
			['', [13,14,15,16]],
			['', [16,17,18,19]],
			['', [20,21,22,23]],
		],
	},
	'右' : {
		'名' : 'グルティア軍(9)',
		'指揮官' : persons['ジュダ'],
		'編成' : [
			['キラーアーチ(1)', [25]],
			['アイアンアーチ(7)', [26,27,28,29,30,31,32]],
			
		],
	},
}
