from .params import *
scene_dir = [
	'00-プロローグ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]
#files = []

org_im = [14]

title = 'プロローグ'
a = 0.5

scene = [ 
	
	
	['00', a, [
	'北半島を解放したセリスたちは、',
	'ミーズの城を前進基地として、',

	'今後の進むべき道を模索していた。',
	]],
	['02', a, [
	'ミーズ城から先は険しい山々が連なる',
	'竜騎士の国、トラキアである。',
	]],
	['03', a, [
	'トラキア王トラバントは、',
	'アルヴィス皇帝と結び、',
	
	'グランベル帝国の唯一の同盟者として、',
	'この辺境の地を統治していた。',
	]],
	['05', a, [
	'そして、王都トラキアには二人の子供、',
	'アリオーン王子とアルテナ王女を、',
	]],
	['06', a, [
	'カパトギア城にはトラキアの盾との、',
	'異名を持つ名将ハンニバルを、',
	]],
	['07', a, [
	'ルテキア城には王の腹心である、',
	'ディスラー将軍を、',
	]],
	['08', a, [
	'グルティア城には帝国より派遣された、',
	'暗黒教団のジュダ司教を配して、',
	]],
	['09', a, [
	'解放軍との全面対決を準備していたのである。',
	
	'',
	'トラキアの人々は、',
	'セリスたちを侵略者と恐れ、',
	
	'みずから武器を取って戦おうとしていた。',
	
	'この戦いに正義はあるのか？',
	'誰のためにわれらは戦うのか？',
	
	'それは、セリスたちにとって、',
	'初めての試練であった・・・。',
	]],
	
	['14', a, []],
	
	]


