from .params import *
scene_dir = [
	'04-vsキンボイス/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsキンボイス'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['007', bat,[]],
	['005', a, [
	'オレ様に剣を向けるとは',
	'・・・バカな奴等だ！',
	'どたまカチわってやる！',
	]],
	['017', bat,[]],
	['027', bat,[]],
	['037', bat,[]],
	['035', a, [
	'ううっ、いてぇよぉ・・・',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
