from .params import *
scene_dir = [
	'21-マンフロイ暗躍/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase4,5 : ヴェルダン出撃'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['', a, [
	'ジャムカ出撃',
	]],
	['011', a, [
	'親父、これだけ言っても',
	'まだ聞いてはくれないのか',
	
	'既に兄貴達は倒され、',
	'敵がこの城に攻めてくるのは時間の問題だ',
	
	'グランベルの指揮官シグルド公子は、',
	'決して悪い人間ではない',
	'もうこれ以上戦うのはやめてくれ',
	]],
	['032', a, [
	'しかしのう、',
	'もともとはグランベルが攻め込んでくると言うから',
	'ガンドルフの出撃を許したのだ',
	
	'わしは最初から戦うつもりなどなかった',
	]],
	['051', a, [
	'それもあのサンディマとかいう',
	'魔法使いの話だろ',
	
	'親父も兄貴達もあいつを信用し過ぎる',
	'みんな奴に騙されているんだ',
	]],
	['072', a, [
	'これはこれはジャムカ王子',
	'ちと言葉が過ぎるのではありませんかな',
	
	'王子には兵を率いて出撃するというお役目がある筈、',
	
	'こんなところでグズグズしてもらっては困りますな',
	]],
	['101', a, [
	'サンディマ！貴様！！',
	]],
	['102', a, [
	'もうよいジャムカ、',
	'サンディマの言う通り、兵を率いて出陣せよ',
	]],
	['111', a, [
	'親父！・・・わかった・・・',
	'・・・これほど言っても駄目なら俺も覚悟を決める',
	
	'しかし、この戦いに勝って戻ったら',
	'サンディマ、',
	'貴様だけは生かしてはおかぬ！',
	]],
	['130', fld,[]],
	
	['改ページ', -1, ['']],
	['', a, [
	'マンフロイ暗躍',
	]],
	['141', a, [
	'サンディマよ、',
	'お前が今まで話してきたことはまことだろうな',
	
	'グランベルが我が国に野心を持っていると、',
	'お前は言ったが・・・',
	]],
	['152', a, [
	'ふっ・・・今頃何を言っている',
	'ヴェルダンも少しは役に立つかと思ったが、',
	'やはり辺境の蛮族よ',
	
	'まったく使い物にもならぬ',
	'もう、お前にも用はないわ！',
	'今後は兵士どもにはわしが直接命令する',
	]],
	['171', a, [
	'なっ、何をする！？ぐっ、',
	'ぐわぁ',
	]],
	['181', a, [
	'',
	]],
	['182', a, [
	'ふっ、老いぼれめ・・・',
	]],
	['', a, [
	'',
	]],
	['191', a, [
	'サンディマよ、バトゥ王を殺したのか',
	'それでヴェルダンの兵士は言うことを聞くのか？',
	]],
	['192', a, [
	'あっ、これはマンフロイ大司教！',
	'お出ででしたか、',
	'ご心配には及びません',
	
	'兵士どもには、王は病気とでも言っておきます',
	]],
	['211', a, [
	'うむ、そうか',
	'',
	'それで、こちらの様子はどうじゃ',
	'計画は進んでおるか',
	]],
	['212', a, [
	'申し訳ございません',
	'グランベル国への侵攻は、',
	
	'あのシグルドとかいう小僧に邪魔をされて',
	'思いの外、手こずっております',
	]],
	['231', a, [
	'ふむ・・・',
	'ならばロプトの血のほうはどうじゃ',
	'シギュンの娘は見つけたのか',
	]],
	['232', a, [
	'それが・・・いまだ・・・',
	]],
	['241', a, [
	'馬鹿者、',
	'それではワシがせっかく見つけたあの小僧、',
	
	'・・・バーハラにいるシギュンの息子を',
	'使う方法がないではないか',
	
	'シギュンはロプト皇帝の弟だった',
	'マイラ王子の子孫、',
	
	'つまり、唯一、ロプト一族の血を受け継ぐ者なのだ',
	
	'その女がマイラの戒めを破り、',
	'初めて二人の子供を生んだ',
	'お前にはその意味がわかるか',
	]],
	['282', a, [
	'はっ、その二つの血が交われば',
	'暗黒神ロプトウスが復活するという・・・',
	]],
	['291', a, [
	'そうだ、ロプト帝国の子孫である我らが',
	'再び世に出るためには、',
	
	'何としても暗黒神を目覚めさせねばならぬ',
	'サンディマ、お前もわかっておるだろう',
	
	'',
	'我らはこの数百年の間、',
	'イード砂漠の奥深くに隠れ住み、苦難に耐えながら',
	
	'帝国再建の日が来るのを夢見てきた',
	
	'そして、ようやくそのチャンスが訪れたのだ',
	]],
	['332', a, [
	'はっ、この命に替えても我が使命、果たします！',
	]],
	['350', fld,[]],
	
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘(屋内)
	# 7 戦闘(屋外)
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
