base_dir = '/storage/43E3-332A/others/test/work/ROM/SNES/ファイアーエムブレム 聖戦の系譜 (J)/'
#base_dir = './test/'
chaper_dir = '01-第一章-精霊の森の少女/'
ivent_dir = '04-vsキンボイス/'

title = 'Phase1 : vsキンボイス'

dirs = [
	base_dir + chaper_dir + ivent_dir,
]

#files = [
#]

a = 1
fld = 0.5
bat = 0.75

scene = [
	['007', bat,[]],
	['005', a, [
	'オレ様に剣を向けるとは',
	'・・・バカな奴等だ！',
	'どたまカチわってやる！',
	]],
	['017', bat,[]],
	['027', bat,[]],
	['037', bat,[]],
	['035', a, [
	'ううっ、いてぇよぉ・・・',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
