from .params import *
scene_dir = [
	'20-マーファ制圧/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : マーファ制圧後'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['', a, [
	'ディアドラとの出会い',
	]],
	
	['001', a, [
	'いやっ、はなしてください！',
	]],
	['002', a, [
	'へへー、いいじゃねぇか',
	'ちょっとくらい付き合ってくれてもよぉ',
	]],
	['011', a, [
	'私は早く村に帰りたいの',
	'お願いです、私に構わないで',
	]],
	['012', a, [
	'うるせぇな！',
	'ごちゃごちゃ言ってると、酷い目にあわすぞ！',
	]],
	['021', a, [
	'おい、おまえ達、何をしている',
	'その娘を離せ',
	]],
	['022', a, [
	'なんだよ、貴様！',
	'・・・げっ、もしやあんた、',
	'グランベルの聖騎士！？',
	]],
	['031', a, [
	'わかったなら早く行け',
	'私は貴様らの様な連中が、一番嫌いだ',
	
	'その娘に謝って、',
	'早く私の前から失せろ！',
	]],
	['042', a, [
	'わ、わかったよぉ・・・',
	'すまんな、ねぇちゃん',
	
	'ちょっとからかっただけなんだ',
	'許してくれよ',
	]],
	
	['', a, ['']],
	
	['061', a, [
	'大丈夫かい、怪我はない？',
	]],
	['062', a, [
	'はい・・・ありがとうございました',
	'シグルド様・・・',
	]],
	['071', a, [
	'えっ、私の事を知っているのかい？',
	]],
	['072', a, [
	'少し前、このお城で',
	'エーディンという女の人とお会いして・・・',
	]],
	['081', a, [
	'エーディンが私の事を話したのか',
	]],
	['082', a, [
	'はい、だからすぐにわかりました',
	'想像していた通りの方だから・・・',
	]],
	['091', a, [
	'君は・・・名は何という？',
	]],
	['092', a, [
	'・・・ごめんなさい',
	'・・・私・・・もう行かなくては・・・',
	]],
	['101', a, [
	'あっ、待ってくれ！もう少しだけ話を',
	]],
	['102', a, [
	'・・・ホントにごめんなさい',
	'お会いできて嬉しかった・・・',
	]],
	['111', a, [
	'えっ、いったいどういうことだ？',
	'待ってくれ！',
	'あっ・・・',
	]],
	
	['120', fld,[]],
	
	['151', a, [
	'シグルド殿、どうされたのかな？',
	]],
	['152', a, [
	'あ・・・あなたはこの街の長老！',
	'今、走り去っていった女性は誰なのです？',
	]],
	['161', a, [
	'ああ、あの娘はディアドラといってな',
	'精霊の森の巫女じゃ',
	]],
	['162', a, [
	'ディアドラ・・・美しい人ですね・・・',
	]],
	['171', a, [
	'ほぉー、あなたほどの方でも',
	'美人には弱いとみえる',
	'もしや、一目惚れというやつですかな',
	]],
	['172', a, [
	'長老、からかわないで下さい',
	'しかし、本当に美しい人だった',
	'できればもう一度会いたい',
	]],
	['181', a, [
	'それはちと難しいのう',
	'元々精霊の村の者は',
	'外界とは関わりを持たないし、',
	
	'その上、',
	'あの娘は人と交わってはならぬという',
	'宿命を背負っておる',
	
	'もし破ればこの世界に大いなる災いが',
	'降りかかると村の者は信じておるのじゃ',
	
	'悪い事は言わん',
	'あの娘に関わるのはおよしなされ',
	]],
	['212', a, [
	'いや、私はそんな迷信は信じない',
	'それではあの娘が哀れです',
	'ディアドラ・・・もう一度会いたい',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘(屋内)
	# 7 戦闘(屋外)
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
