from .params import *
scene_dir = [
	'25-vsサンディマ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : vsサンディマ'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['006', bat,[]],
	['005', a, [
	'ククク・・・',
	'我が暗黒魔法の恐ろしさ',
	'とくと思い知れ',
	]],
	['026', bat,[]],
	['036', bat,[]],
	['046', bat,[]],
	['045', a, [
	'マンフロイ大司教・・・',
	'どうか・・・お許しあれ・・・',
	]],
	
	['', a, [
	'ジャムカvsサンディマ',
	]],
	['013', a, [
	'くくく',
	'ジャムカよ、最早手遅れだ',
	'貴様の親父は死んだぞ',
	]],
	['014', a, [
	'な、なんだと！？',
	'サンディマ、貴様・・・',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘(屋内)
	# 7 戦闘(屋外)
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
