from .params import *
scene_dir = [
	'19-vsガンドルフ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : vsガンドルフ'



a = 1
fld = 0.5
bat = 0.75

scene = [
	['006', bat,[]],
	['005', a, [
	'ちくしょう、',
	'女には逃げられるし',
	'城は攻められるし',
	
	'俺はなんて不幸なんだ！',
	]],
	['046', bat,[]],
	['056', bat,[]],
	['066', bat,[]],
	['065', a, [
	'・・・な・・・なんてことだ',
	'・・・グフッ',
	]],
	
	['', a, [
	'アゼルvsガンドルフ',
	]],
	['023', a, [
	'なんだお前は？',
	'ガキがいっちょまえに気取るんじゃねえぜ！',
	]],
	['024', a, [
	'お前がガンドルフか',
	'エーディンをよくも・・・',
	]],
	
	['改ページ', -1, ['']],
	
	['', a, [
	'ミデェールvsガンドルフ',
	]],
	['033', a, [
	'なに！お前はあの時の弓騎士！？',
	'ちっ、しくじったぜ',
	'生きてやがったか！',
	]],
	['034', a, [
	'ガンドルフ、覚悟しろ！',
	'貴様だけは許さない！！',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘(屋内)
	# 7 戦闘(屋外)
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
