from .params import *
scene_dir = [
	'05-女剣士アイラ/01/',
	'05-女剣士アイラ/02/',
	'05-女剣士アイラ/03/',
	'05-女剣士アイラ/04/',
	'05-女剣士アイラ/05/',
	'05-女剣士アイラ/06/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : 女剣士アイラ'

fld = 0.5
bat = 0.75

scene = [
	['', a, [
	'キンボイス撃破後',
	]],
	['004', a, [
	'いよいよか・・・',
	'私に近づく者はあわれだな・・・',
	]],
	
	['', a, [
	'アイラと戦闘',
	]],
	['017', bat,[]],
	['015', a, [
	'シャナンのためだ',
	'死んでもらうぞ',
	'我が流星剣、受けてみよ！',
	]],
	
	['改ページ', -1, ['']],
	
	['', a, [
	'ジェノア城制圧',
	]],
	['021', a, [
	'シグルド様、城内の牢に',
	'幼い子供が捕らえられていました',
	]],
	['031', a, [
	'・・・・・・',
	]],
	['032', a, [
	'どうした、なぜ黙っている？',
	'捕らえられた理由を話して欲しい',
	]],
	['041', a, [
	'・・・おまえは',
	'キンボイスの仲間じゃないのか？',
	]],
	['042', a, [
	'キンボイスは私達が倒した',
	'もう何も恐れることはない',
	]],
	['051', a, [
	'え！それじゃアイラは',
	'もう戦わなくていいんだね',
	
	'アイラ姉さんは、ぼくのために',
	'無理矢理戦わされていたんだ',
	'おねがい！アイラを助けて！！',
	]],
	['062', a, [
	'あの女剣士、何か理由があって',
	'戦っているように見えたが',
	'やっぱりそうだったか・・・',
	
	'わかった',
	'彼女に君が無事だった事を知らせてこよう',
	'君の名は？',
	]],
	['081', a, [
	'シャナン',
	'・・・イザーク王国の王子、シャナンだ・・・',
	]],
	['082', a, [
	'イザークの王子・・・そうだったか',
	
	'いろいろと事情があるのだろうが',
	'しばらくは我が軍と行動を共にするといい',
	
	'今は辛抱するんだ',
	'いずれ国に帰れる日もあるだろうから',
	]],
	['111', a, [
	'しかしシグルド様',
	'我が国は今、イザーク王国と',
	'戦争の真っ最中です',
	
	'国王にご報告しなくともよいのですか？',
	]],
	['122', a, [
	'オイフェ、',
	'イザークとは確かに戦争をしている',
	'しかし子供には関係の無いことだ',
	
	'しばらくは私が預かり、',
	'いずれ機会を見つけて',
	'国に帰してあげようと思う',
	]],
	['141', a, [
	'はい、わかりました',
	]],
	['', a, [
	'',
	]],
	['151', a, [
	'やっぱりシグルド様は',
	'お優しい方だな・・・',
	]],
	
	['', a, [
	'ジェノア城制圧後',
	]],
	['174', a, [
	'何！？',
	'ジェノア城がグランベルに奪われただと？',
	'くっ、シャナンを助けねば・・・',
	]],
	
	['改ページ', -1, ['']],
	
	['', a, [
	'アイラがジェノア城に帰城',
	]],
	['184', a, [
	'シャナンがいない！？',
	'くっ、グランベルの連中が連れ去ったか',
	'奴等、生かしてはおかぬ！',
	]],
	
	['', a, [
	'シグルド→アイラ',
	]],
	['193', a, [
	'待て、アイラ！',
	'シャナン王子は私達が取り戻した',
	'もう戦わなくていいんだ',
	]],
	['194', a, [
	'何！？シャナンを助けてくれた？',
	'それは本当なのか！',
	]],
	['203', a, [
	'ああ、君がイザーク王の妹であることも',
	'シャナン王子から聞いた',
	
	'君がグランベルを憎み',
	'我らに敵対するのもわかる',
	
	'しかし、君はあの幼い王子を',
	'守らねばならない筈だ',
	
	'こんなつまらない戦いで',
	'命を落としていいのか',
	]],
	['234', a, [
	'私は死を決意した兄王から',
	'シャナンを託されて',
	'この国まで落ちのびてきた',
	
	'確かにヴェルダンなどのために',
	'死にたくはない',
	
	'シャナンが成人し、立派な王となるまで',
	'私は死ぬわけにはいかない',
	]],
	['263', a, [
	'ならば剣をおさめよ',
	'私も光の戦士バルドの末裔',
	'君の信頼を裏切るようなことはしない',
	]],
	['264', a, [
	'わかった・・・それなら私も恩に報いる',
	'それがイザークの戦士の掟だ',
	'しばらくは、あなたにこの剣を捧げよう',
	
	'だがグランベルが憎い敵である事は',
	'今も変わらぬ',
	
	'いずれ剣を交える日も来る事を',
	'覚悟しておいてほしい',
	]],
	['293', a, [
	'戦争とは残酷なものだ',
	'イザークの剣士アイラ、',
	'・・・私は君を敵にはしたくない',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘(屋内)
	# 7 戦闘(屋外)
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
