from .params import *
scene_dir = [
	'81-シグルド軍/',
	'88-ジャムカ軍/',
	'89-サンディマ軍/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : vsサンディマ' 

persons = {
	'シグルド'  : '00',
	'サンディマ'  : '24',
}

organization = {
	'左' : {
		'名' : 'シグルド軍(13)',
		'指揮官' : persons['シグルド'],
		'編成' : [
			['', [1,2,8,9]],
			['', [3,4,7,5]],
			['', [6,10,11]],
			['(会話後加入)', [12]],
		],
	},
	'右' : {
		'名' : 'サンディマ軍(11)',
		'指揮官' : persons['サンディマ'],
		'編成' : [
			['アクスファイター(2)', [25,26]],
			['ハンター(8)', [27,28,29,30,31,32,33,34]],
		],
	},
}
