from .params import *
scene_dir = [
	'87-ノディオン軍/',
	'86-ハイライン軍/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : ノディオン軍vsハイライン軍' 

persons = {
	'ノディオン'  : '00',
	'ハイライン'  : '10',
}

organization = {
	'左' : {
		'名' : 'エルトシャン軍(10)',
		'指揮官' : persons['ノディオン'],
		'編成' : [
			['ソシアルナイト(9)', [1,2,3,4,5,6,7,8]],
			['', [9]],
		],
		'倍率' : 0.375,
	},
	'右' : {
		'名' : 'エリオット軍(12)',
		'指揮官' : persons['ハイライン'],
		'編成' : [
			['ランスナイト(11)', [11,12,13,14,15,16,17,18]],
			['', [19,20,21]],
		],
	},
}
