from .params import *
scene_dir = [
	'81-シグルド軍/',
	#'82-ジェノア軍/',
	#'84-ヴェルダン軍/',
	'83-マーファ軍/',
	#'85-ノディオン軍/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsガンドルフ' 

persons = {
	'シグルド'  : '00',
	'ガンドルフ'  : '12',
}

organization = {
	'左' : {
		'名' : 'シグルド軍(12)',
		'指揮官' : persons['シグルド'],
		'編成' : [
			['', [1,2,8,9]],
			['', [3,4,7]],
			['', [5,6]],
			['(2ターン目に加入)', [10,11]],
		],
	},
	'右' : {
		'名' : 'ガンドルフ軍(21)',
		'指揮官' : persons['ガンドルフ'],
		'編成' : [
			['アクスファイター(1)', [13]],
			['バーバリアン(16)', [14,15,16,17,18,19,20,21]],
			['', [22,23,24,25,26,27,28,29]],
			['ハンター(3)', [30,31,32]],
			
			
		],
	},
}
