from .params import *
scene_dir = [
	'00-プロローグ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]
#files = []

org_im = [15]

title = 'プロローグ'
a = 0.5

scene = [ 
	['00', a, [
		'エバンス城にエーディンの姿はなかった。',
	]],
	['01', a, [
		'既に公女はヴェルダン国内へと、',
		'連れ去られた後だったのだ。',
	]],
	['02', a, [
		'ヴェルダンは深い森に覆われた国。',
		
		'たびたび国境を荒らしたヴェルダンを、',
		'グランベルの人々は蛮族と呼んでいる。',
	]],
	['04', a, [
		'今のヴェルダン王バトゥの代になって',
		'国境での戦いは止んでいた。',
		
		'穏やかな性格のバトゥ王は、',
		'野望にもえる息子達をなだめ',
		
		'グランベルとの和平を保っていたのだ。',
		
		'しかし、その和平は',
		'他ならぬバトゥ自身によって破られた。',
		
		'バトゥ王は、三人の息子達に',
		'グランベル侵略の命を下した。',
	]],
	['09', a, [
		'ジェノア城の次男キンボイス',
	]],
	['10', a, [
		'マーファ城には、長兄ガンドルフ',
		'そして末弟ジャムカ',
		
		'森に潜む蛮族たちが',
		'シグルドを待ち受けている。',
	]],
	['12', a, [
		'エーディンは一体どこにいるのか',
		'バトゥ王はなぜ戦いを挑むのか・・・。',
		
		'目の前に広がるのは、',
		'昼なお暗い、ヴェルダンの大森林。',
		
		'精霊が住むという森に、',
		'シグルドは足を踏み入れようとしていた。',
	]],
	['15', a, []],
]


