from .params import *
scene_dir = [
	'18-vsヴォルツ',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : vsヴォルツ'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['007', bat,[]],
	['005', a, [
	'これも仕事だ、悪く思うなよ',
	]],
	['027', bat,[]],
	['036', bat,[]],
	['047', bat,[]],
	['045', a, [
	'ま、まさか・・・',
	'俺を倒せる奴がいるとは・・・',
	
	'(エリートリング)',
	]],
	
	['', a, [
	'ベオウルフvsヴォルツ',
	]],
	['013', a, [
	'ふっ、ベオウルフか',
	'俺と戦うには少し早すぎたようだな',
	]],
	['014', a, [
	'ああ、確かにな・・・',
	'だが俺も傭兵だ',
	'命じられたからには仕方ねえ・・・',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	# 7 戦闘(屋外)
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
