from .params import *
scene_dir = [
	'35-vsシャガール',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase4 : vsシャガール'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['006', bat,[]],
	['005', a, [
	'ちっ・・・侮るなよ',
	'貴様などにワシが倒せるものか',
	]],
	['016', bat,[]],
	['026', bat,[]],
	['036', bat,[]],
	['035', a, [
	'ううっ・・・待ってくれ',
	'・・・命だけは・・・',
	
	'',
	'(リブローの杖)',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	# 7 戦闘(屋外)
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
