from .params import *
scene_dir = [
	'06-vsエリオット',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsエリオット'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['006', bat,[]],
	
	['005', a, [
	'げっ・・・',
	'なぜグランベル軍がここに！',
	
	'こうなったらまとめて片付けてやる！',
	]],
	['026', bat,[]],
	['036', bat,[]],
	#['046', bat,[]],
	['045', a, [
	'ちくしょう・・・なぜいつもエルトシャンばかりが・・・',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
