from .params import *
scene_dir = [
	'25-vsクレメント',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : vsクレメント'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['006', bat,[]],
	['005', a, [
	'くそ、侵略者め！',
	'・・・かくなる上は、このワシが相手になってくれるわ！',
	]],
	['016', bat,[]],
	['026', bat,[]],
	['036', bat,[]],
	['035', a, [
	'くっ・・・覚えておれ・・・',
	
	'',
	'(スリープの杖)',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	# 7 戦闘(屋外)
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
