from .params import *
scene_dir = [
	'28-マンフロイ暗躍',
	'29-ザイン出撃',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase4 : アグスティ援軍'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['001', a, [
	'なにっ、マッキリーまで落とされただと？',
	'ザイン、こうなっては仕方ない',
	'貴様は残りの全軍を率いて出陣せよ',
	]],
	['002', a, [
	'はあ、しかし・・・',
	]],
	['011', a, [
	'つべこべ言わず、早く行け！！',
	]],
	['', a, [
	'',
	'',
	]],
	['012', a, [
	'シャガールよ、見苦しいぞ',
	'なにも、まだ負けたわけでもあるまいに',
	]],
	['021', a, [
	'貴様はマンフロイ！',
	
	'ぐぐっ・・・',
	'貴様の言う通りにしていたらこのザマだ',
	'いったいどうしてくれる！',
	]],
	['032', a, [
	'ふっふっふ',
	'儂はただ、王が邪魔なら殺せと言ったまでだ',
	
	'全てはお前の野心からでたこと',
	'そうではないのかの',
	]],
	['051', a, [
	'くそっ',
	'シグルドの軍がここまで強いとは思わなかった・・・',
	
	'マンフロイ、教えてくれ',
	'俺はいったいどうすればよいのか',
	]],
	['062', a, [
	'まだ、方法はある',
	
	'いざというときは、あの小僧、',
	'地下牢に捕らえてあるエルトシャンを利用すればよい',
	
	'奴の言うことなら、シグルドとて聞かぬわけにはいかぬだろうよ',
	
	'今のうちに、あやつに詫びでも入れておくのだな',
	]],
	['101', a, [
	'そ、そうだな',
	'エルトシャンなら助けてくれてくれるだろう',
	'わかった、そうしよう',
	]],
	['111', a, [
	'',
	]],
	['112', a, [
	'ふっ、馬鹿め・・・',
	]],
	['131', a, [
	'マンフロイ大司教',
	'クルト王子の殺害、確かに見届けました',
	]],
	['132', a, [
	'そうか、あやつら、面白いように動いてくれる',
	
	'我らが宿敵ナーガの一族も、残るはあの老いぼれ一人',
	'奴がくだばるのも時間の問題じゃ',
	
	'後は暗黒神さえ復活できれば、我らが世になる・・・',
	]],
	['161', a, [
	'アルヴィス様は大司教の申し入れを承知されたのですか？',
	]],
	['162', a, [
	'聞かぬ訳にはいくまい',
	'奴の体にはロプトウスの血が流れておる',
	
	'もしその事がもれれば、',
	'奴は捕らえられ、暗黒神の一族として火あぶりの刑となる',
	
	'あの気位の高い男が、そんな事を我慢できるものか',
	]],
	['191', a, [
	'では国王を裏切り、自ら皇帝となると・・・',
	]],
	['192', a, [
	'うむ・・・だがそれだけでは足りぬ',
	
	'ロプトウス神が転生するためには、',
	'アルヴィスと・・・もう一人・・・あの女の娘が必要なのだ・・・',
	]],
	
	['', a, [
	'ザイン出撃',
	]],
	['200', fld,[]],
	['214', a, [
	'出撃だ！',
	'祖国のために死ねる事を、誇りと思え！！',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	# 7 戦闘(屋外)
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
