from .params import *
scene_dir = [
	'20-vsマクベス',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : vsマクベス'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['006', bat,[]],
	['005', a, [
	'ま、まさかグランベルか！？',
	'くそっ、傭兵どもめ',
	'いくら払ったと思っておる！',
	
	'ううっ・・・こうなったら私が相手だ！',
	]],
	['026', bat,[]],
	['046', bat,[]],
	['056', bat,[]],
	['055', a, [
	'ぐふっ・・・なんで私が・・・',
	
	'(シールドリング)',
	]],
	
	['', a, [
	'レヴィンvsマクベス',
	]],
	['033', a, [
	'な、なんだお前は・・・',
	]],
	['034', a, [
	'お前がマクベスか？',
	'お前は王として失格のようだ',
	'あきらめるんだな・・・',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	# 7 戦闘(屋外)
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
