from .params import *
scene_dir = [
	'09-vsボルドー',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsボルドー'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['006', bat,[]],
	['005', a, [
	'なにっ、グランベル軍だと！？',
	'くそう・・・どいつもこいつも役立たずどもめ！',
	
	'こうなったらワシが相手だ！',
	]],
	['026', bat,[]],
	['036', bat,[]],
	['045', a, [
	'うう・・・ワシの城が・・・・・・',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
