from .params import *
scene_dir = [
	#'81-シグルド軍',
	'82-ノディオン軍',
	'83-ハイライン軍',
	#'83-ハイライン軍2',
	#'83-ハイライン軍3',
	#'84-アンフォニー軍',
	#'85-アンフォニー軍',
	#'86-傭兵軍',
	#'87-シグルド軍',
	#'88-シグルド軍',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : ラケシスvsエリオット' 

persons = {
	'ラケシス'  : '00',
	'エリオット'  : '04',
}

organization = {
	'左' : {
		'名' : 'ラケシス軍(4)',
		'指揮官' : persons['ラケシス'],
		'編成' : [
			['イーヴ', [1]],
			['アルヴァ', [2]],
			['エヴァ', [3]],
		],
	},
	'右' : {
		'名' : 'エリオット軍(10)',
		'指揮官' : persons['エリオット'],
		'編成' : [
			['アクスナイト(3)', [5,6,7]],
			['ランスナイト(6)', [8,9,10,11,12,13]],
		],
	},
}
