from .params import *
scene_dir = [
	'00-プロローグ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]
#files = []

org_im = [10]

title = 'プロローグ'
a = 0.5

scene = [ 
	['00', a, [
		'ヴェルダン王国を制圧したシグルドは、',
		'バーハラ城からの命令に従って',
		
		'国境の城、エバンスの城主となり',
		'ディアドラを妻に迎えた',
	]],
	['02', a, [
		'グランベルによるヴェルダン制圧は',
		'アグストリアに大きな混乱をもたらした',
		'',
		'アグストリアの諸侯達は、',
		'強い反グランベルの意思を示し',
		
		'あくまで和平を重んじた',
		'アグストリアの賢王イムカは',
		
		'何者かの手によって暗殺された',
	]],
	['06', a, [
		'代わって国を継いだのは',
		'イムカ王の長子、シャガール王子だった',
		
		'グランベルの国軍は',
		'いまだ、はるか東のイザークにある',
	]],
	['08', a, [
		'シャガールはアグストリアの諸公に',
		'ヴェルダン侵略の命を下した',
		
		'エバンス城を守るシグルドは',
		'再び、戦いの真っ只中に立たされた',
	]],
	
	['改ページ', -1, ['']],
	
	['10', a, []],
]


