from .params import *
scene_dir = [
	'23-vsドバール',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : vsドバール'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['006', bat,[]],
	
	['005', a, [
	'くそっ、どいつもこいつも役立たずばかりだ！',
	]],
	['016', bat,[]],
	['036', bat,[]],
	['045', a, [
	'ちくしょう・・・',
	
	'',
	'(パワーリング)',
	]],
	
	['', a, [
	'ブリギッドvsドバール',
	]],
	['023', a, [
	'けっ、まだ生きてやがったか',
	'しぶとい女め！',
	]],
	['024', a, [
	'ドバール！',
	'あんただけは許さないからね！！',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
