from .params import *
scene_dir = [
	'76-村',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : 会話イベント'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['', a, [
	'村7',
	]],
	['004', a, [
	'ああ、よくきなすったね',
	'この魔法のくすりをのむといいよ',
	'守りの力が少しだけあがるからね',
	
	'',
	'(DEF+1)',
	
	'',
	'(5000G)',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
