from .params import *
scene_dir = [
	'11-vsパピヨン/',
	'13-トラバント逃走/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : vsパピヨン'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['007', bat,[]],
	
	['005', a, [
	'ふふふ',
	'竜騎士団の恐ろしさ',
	'思い知るがいい、覚悟しろ！',
	]],
	
	['017', bat,[]],
	['027', bat,[]],
	
	['035', a, [
	'ううっ・・・・',
	'・・・トラキアに栄光あれ・・・！',

	'',
	'(ライブのうでわ)',
	]],
	
	['', a, [
	'パピヨン撃破後',
	]],
	['052', a, [
	'ちっ、パピヨンめ、しくじったか',
	'このあたりが引き時か',
	'アグストリアと心中する義理はない',

	'さらばだ、おろかなシャガール王よ',
	]],
	
	['070', fld,[]],

	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
