from .params import *
scene_dir = [
	'81-シグルド軍',
	#'82-マディノ軍',
	#'83-オーガヒル軍',
	#'84-エルトシャン軍',
	'85-シャガール軍',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : vsシルベール軍' 

persons = {
	'シグルド'  : '00',
	'シャガール'  : '21',
}

organization = {
	'左' : {
		'名' : 'シグルド軍(20)',
		'指揮官' : persons['シグルド'],
		'編成' : [
			['', [2,3,4,5]],
			['', [6,7,8,9]],
			['', [10,11,12,13]],
			['', [14,15,16,17]],
			['', [18,19,20]],
			#['(戦闘は不参加)', [1]],
		],
	},
	'右' : {
		'名' : 'シャガール軍(14)',
		'指揮官' : persons['シャガール'],
		'編成' : [
			['アーマー(6)', [22,23,24,25,26,27]],
			['ボウアーマー(4)', [28,29,30,31]],
			['隊長,アーマー(2)', [32,33,34]],
		],
	},
}
