from .params import *
scene_dir = [
	'81-シグルド軍',
	'82-マディノ軍',
	'83-オーガヒル軍',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsマディノ軍' 

persons = {
	'シグルド'  : '00',
	'ジャコバン'  : '21',
}

organization = {
	'左' : {
		'名' : 'シグルド軍(20)',
		'指揮官' : persons['シグルド'],
		'編成' : [
			['', [2,3,4,5]],
			['', [6,7,8,9]],
			['', [10,11,12,13]],
			['', [14,15,16,17]],
			['', [18,19,20]],
			['(戦闘は不参加)', [1]],
		],
	},
	'右' : {
		'名' : 'ジャコバン軍(39)',
		'指揮官' : persons['ジャコバン'],
		'編成' : [
			['ビショップ(1),マージ(2),アーマー(2)', [22,23,24,28,29]],
			['ソードアーマー(3),ボウアーマー(2)', [25,26,27,30,31]],
			['アイアンアーチ(1),ロングアーチ(2)', [32,33,34]],
			['ボウナイト,(1),アーチナイト(4)', [35,36,37,38,39]],
			['ジェネラル,(1),アクスアーマー(4)', [40,41,42,43,44]],
			['ファイアーマージ,(1),マージ(4)', [45,46,47,48,49]],
			['デュークナイト,(1),ランスナイト(4)', [50,51,52,53,54]],
			['ジェネラル,(1),アーマー(4)', [55,56,57,58,59]],
		],
	},
}
