from .params import *
scene_dir = [
	'00-プロローグ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]
#files = []

org_im = [21]

title = 'プロローグ'
a = 0.5

scene = [ 
	['00', a, [
		'アグスティを失ったシャガール王は、',
		'北のマディノ城に宮廷をうつした',

		'エルトシャンとの約束どおり、',
		'シグルドはこれを追撃しなかった',
	]],
	['02', a, [
		'アグスティ城で兵を休めながら、',
		'エルトシャンとの約束を果たすため、',

		'シグルドはアグスティ返還の交渉を',
		'ねばり強く続けた',

		'しかし、バーハラからの回答はいつも、',
		'そのままアグスティにとどまり、',

		'住民を統治せよというものだった',
	]],
	['06', a, [
		'半年がすぎる間に',
		'グランベルから派遣された役人たちが、',

		'アグストリアの国土を、',
		'わがもの顔にのし歩くようになった',

		'アグストリアの民の不満は、',
		'少しずつふくれあがっていった',

		'やがて、シグルドが恐れていた',
		'あらたな戦いが始まった',
	]],
	['10', a, [
		'マディノで兵をととのえたシャガールが',
		'王都アグスティを取り戻そうと、',
	]],
	['11', a, [
		'シグルドに戦いを挑んできたのだ',
	]],
	['12', a, [
		'マディノの北では、',
		'悪名高いオーガヒルの海賊が、',

		'戦に乗じて動きはじめている',
	]],
	['14', a, [
		'バーハラからの命令は、',
		'アグスティ城を死守せよと告げていた',

		'出陣するシグルドの心は重かった',
	]],
	['16', a, [
		'マディノの南西、シルベール城には',
		'エルトシャンの軍がひかえている',

		'この戦いは、',
		'友を裏切るものになるかもしれない',

		'シグルドはこの時、',
		'アグストリアの北の果てで、',

		'歴史をも変える戦いに臨もうとしていた',
	]],
	
	['改ページ', -1, ['']],
	
	['21', a, []],
]


