from .params import *
scene_dir = [
	'25-vsダナン/',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : vsダナン'

a = 1
fld = 0.5
bat = 0.75

scene = [

	['026', bat,[]],
	
	['025', a, [
	'おのれ、反乱軍どもめ！',
	'グランベル帝国をあまく見るな',
	]],
	
	['036', bat,[]],
	['006', bat,[]],
	
	['015', a, [
	'ぐふ・・・',
	'アルヴィス陛下・・・',
	]],
	
	['', a, [
	'セリスvsダナン',
	]],
	['043', a, [
	'き、貴様がシグルドの小せがれか！',
	'く、くそ！我が父のうらみ、思い知らせてくれる！！',
	]],
	['044', a, [
	'ダナン王・・・あなたの支配によって、',
	'多くの人々が苦しみ、死んでいった',
	'今こそ、その報いを受けるときだ',
	]],
	
	['', a, [
	'ヨハンvsダナン',
	]],
	['053', a, [
	'くっ、ヨハン・・・',
	'つまらぬ女に騙されおって！',
	]],
	['054', a, [
	'ふっ・・・私は愛に生きると誓ったのだ',
	'許せよ、父上・・・',
	]],
	['063', a, [
	'ば、ばかめ・・・',
	]],
	
	['', a, [
	'ヨハルヴァvsダナン',
	]],
	['073', a, [
	'貴様はヨハルヴァか！',
	'親に楯突くとは、一体どういうつもりだ！',
	]],
	['074', a, [
	'すまねえな',
	'だが俺はもう悪事に手を貸すのは、',
	'まっぴらなんだよ',
	
	'親父、悪く思うなよ',
	]],
	['093', a, [
	'く、くそ・・・ヨハルヴァ！',
	]],
	
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
