from .params import *
scene_dir = [
	'16-シュミット軍進軍/',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : シュミット軍進軍'

a = 1
fld = 0.5
bat = 0.75

scene = [

	['000', fld,[]],
	
	['013', a, [
	'何をしておるのだ！',
	'あのバカ息子どもめ、戦い方も知らんのか！',
	
	'シュミット、お前が行け、',
	'反乱軍にうばわれた城を取り戻すのだ！',
	]],
	
	['024', a, [
	'はい、ダナン様、おまかせください',
	]],
	
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
