from .params import *
scene_dir = [
	'10-ガネーシャ城制圧/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : ガネーシャ城制圧'

a = 1
fld = 0.5
bat = 0.75

scene = [

	['002', a, [
	'これがガネーシャ・・・',
	'ずいぶんと荒らされているな・・・',
	]],
	['011', a, [
	'セリスか、久しぶりだな',
	]],
	['012', a, [
	'え？　・・・あっ、レヴィン！！',
	'・・・いや、',
	'・・・シレジアのレヴィン王・・・',
	]],
	['021', a, [
	'昔のように、レヴィンでいいさ',
	'シレジアはあのバーハラの戦いの後、帝国に占領された',
	
	'私は今もこうして生き恥をさらしているが、',

	'シレジアは母上と共に誇りを持ったまま滅んだのだ',

	'私は今も昔も、間抜けな吟遊詩人',
	'オイフェはどう言ったか知らないが、',
	'まちがっても私を王などと呼ぶな！',
	]],
	['052', a, [
	'レヴィン・・・ごめんなさい・・・',
	]],
	['061', a, [
	'ははは、これもシャレさ、気にするな',
	'そんなことより、いよいよ始まったな',
	'長い間、待っていたかいがあったぞ',
	
	'反帝国の兵を挙げるのに、',
	'イザークほど都合の良い国はない',
	]],
	['072', a, [
	'ええ、この国の人達は勇気があるし、',
	'帝国を心から憎んでいます',

	'本当はシャナン王子がいてくれれば、',
	'もっと楽に戦えるのだけど',
	]],
	['091', a, [
	'シャナンはイードの神殿に行ったのか？',
	]],
	['092', a, [
	'ええ、',
	'イザーク王家の家宝、神剣バルムンクが、',
	'イード神殿にあるという情報があって・・・',
	
	'でも、あそこは邪悪な暗黒司祭が支配しているというし、',
	'みんな心配しています',
	]],
	['111', a, [
	'まあ、彼のことだ、心配はいらんさ',
	'それよりもセリス、頼みがある',
	]],
	['112', a, [
	'え？　なんでしょう',
	'私にできることなら喜んでお受けしますが',
	]],
	['121', a, [
	'ユリア、来なさい',
	]],
	['122', a, [
	'',
	]],
	['131', a, [
	'この子は、',
	'幼い頃にバーハラの都で倒れているのを私が助け、',
	
	'今まではシレジアの辺境で保護してきたのだが、',

	'そこもいよいよ危なくなってきたので、',
	'やむなく連れてきた',

	'だが、私はこれからレンスターまで行かねばならん',
	'少々足手まといなんだ',
	
	'',
	'セリス、',
	'悪いがしばらくこの子を預かってくれないか',
	
	'この子はかわいそうな娘だ',
	'なにかひどいショックを受けたのか、',

	'私が助けたときには、何一つ記憶がなかった',
	'いまも、まだ・・・',
	]],
	['182', a, [
	'！　・・・そんなことが・・・',
	'わかりました、私にお任せ下さい',

	'でも、できるだけ早く迎えに来て下さいね',
	'ユリアも・・・心細いでしょうから',
	]],
	['201', a, [
	'ああ、わかっている',
	'おまえたちがイザーク全土を制圧する頃には、',
	'私も戻るさ',
	
	'じゃ、がんばれよ　セリス',
	]],
	['212', a, [
	'レヴィンも、気を付けて！',
	]],
	
	['220', fld,[]],
	
	['231', a, [
	'ユリア',
	]],
	['232', a, [
	'',
	]],
	['231', a, [
	'心細いだろうけど、心配はいらないよ',

	'レヴィンが戻るまで、',
	'ぼくがきみを守るから・・・って、',

	'',
	'ほんとはまだそんなに強くないんだけどね',

	'でも、ぼくはがんばって強くなる',
	'みんなを守れるように、',

	'そして、帝国の圧政からみんなを助けるために、',
	'ぼくは父上のように、強くなるんだ・・・',
	]],
	['272', a, [
	'セリス様・・・・・・・',
	]],
	
	['280', fld,[]],
	#['290', fld,[]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
