from .params import *
scene_dir = [
	'17-vsシュミット/',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : vsシュミット'

a = 1
fld = 0.5
bat = 0.75

scene = [

	['026', bat,[]],
	
	['025', a, [
	'ダナン様のご命令だ',
	'貴様らをこれ以上、行かせはせんぞ！',
	]],
	
	['036', bat,[]],
	['046', bat,[]],
	
	['005', a, [
	'ダナン様・・・お許しを！',
	
	'',
	'(ゆうしゃのおの)',
	]],
	
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
