from .params import *
scene_dir = [
	'09-vsハロルド/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsハロルド'

a = 1
fld = 0.5
bat = 0.75

scene = [

	['006', bat,[]],
	
	['005', a, [
	'くっ・・・',
	'たかが反乱軍ごとき！',
	]],
	
	['016', bat,[]],
	['026', bat,[]],
	
	['035', a, [
	'ぐわ・・・なぜだ・・・・・・',
	'こんな寄せ集めの兵に敗れるのか・・・！？',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
