from .params import *
scene_dir = [
	'12-シレジアからの援軍/',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : シレジアからの援軍'

a = 1
fld = 0.5
bat = 0.75

scene = [

	['000', fld,[]],
	['010', fld,[]],
	
	['024', a, [
	'ふーっ、ごめんねマーニャ',
	'重たかったでしょ',
	]],
	['033', a, [
	'ふーん、',
	'そのペガサスはマーニャっていうのか',
	]],
	['034', a, [
	'アーサー、いいかげんにしてよ',
	'もう少し、もう少しって、',
	'結局イザークまできたじゃない！',
	]],
	['043', a, [
	'無理を言って悪かったな、フィー',
	'もう少しなんだけど、まあ、いいや、あとは歩いてゆくさ',
	]],
	['044', a, [
	'いったいどこに行くつもりなのよ',
	]],
	['053', a, [
	'アルスター',
	]],
	['054', a, [
	'ア、アルスター！？',
	'あんた、バカじゃない',

	'アルスターっていったら、海をこえてさらに南、',

	'ここから一体どれだけあると思っているのよ',
	'歩いていけるわけないじゃない！',
	]],
	['083', a, [
	'いいさ、別に急ぐ旅でもないし',
	]],
	['084', a, [
	'アルスターにいったい何があるのよ',
	]],
	['093', a, [
	'そこに、幼いときに生き別れた妹がいるらしい',

	'おれは小さいときに母と妹を奪われて、',
	'シレジアの片田舎で、一人ぼっちで暮らしてきたけど',
	
	'そんな話を聞いちゃ、やっぱりなぁ・・・',
	'会いたいよ・・・',
	]],
	['114', a, [
	'ふーん、そうなんだ',
	'わかるよ、その気持ち',
	'あたしだって、お兄ちゃんに会いたいもの',
	]],
	['123', a, [
	'きみも生き別れ？',
	]],
	['124', a, [
	'ううん、ずっとシレジアで一緒だったよ',
	'でも、お兄ちゃん、旅に出た',
	'お父さんを捜すんだって言ってさ',
	]],
	['133', a, [
	'父さんを？',
	]],
	['134', a, [
	'あたし達のお父さんね、行方不明なの',
	'お母さん、ずっと待ってたけど帰ってこなかった',
	]],
	['143', a, [
	'それで、お母さんは？',
	]],
	['144', a, [
	'しんじゃった、病気で・・・',
	]],
	['153', a, [
	'そうか・・・ごめん、',
	'へんなこと聞いちゃったな',
	]],
	['154', a, [
	'いいの、',
	'あなた、へんなヤツだと思ってたけど、',
	'そう悪いひとでもないみたいね',
	]],
	['163', a, [
	'ははは、これはどうも',
	'見直してくれたってわけかい',
	]],
	['164', a, [
	'まあね',
	'それで、ホントにこれからどうするの？',
	]],
	['173', a, [
	'うん、そうだなぁ・・・',
	'だけど、そういうきみは？',
	]],
	['174', a, [
	'あたしは、イザークの解放軍に参加するの',

	'',
	'小さい頃ね、お母さんから聞いた、',
	'聖騎士シグルドと勇者達の物語',
	'ずっとあこがれてたの',
	
	'そのシグルド様のご子息がね、',
	'イザークで旗揚げをしたのよ',

	'これはあたしもがんばんなくっちゃ、と思ってさ、',
	'あわててシレジアを出てきたわけ',
	]],
	['213', a, [
	'へぇー、面白そうだな',
	'よし、俺もしばらく手伝うよ',
	'乗せてもらった礼もあるしな',
	]],
	['214', a, [
	'オッケー、そうこなくっちゃ、',
	'がんばりましょうね、あいぼう！',
	]],
	['223', a, [
	'ははは、元気なヤツだな',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
