from .params import *
scene_dir = [
	'28-リボー制圧/',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : リボー制圧'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['001', a, [
	'みごとだセリス',
	'イザークの解放は無事に終わったな',
	]],
	['002', a, [
	'レヴィン、帰っていたんだね',
	]],
	['011', a, [
	'ああ・・・今、戻ったばかりだ',
	'セリス、世界は今ゆれ動いている',
	'なぜだかわかるか',
	]],
	['012', a, [
	'え？　いえ・・・私にはまだ・・・',
	]],
	
	['改ページ', -1, ['']],
	
	['021', a, [
	'アルヴィス卿によって世界が統一され、',
	'グランベル帝国が生まれてすでに十五年',
	'初めのころはそれほど悪くはなかった',
	
	'アルヴィス皇帝は、',
	'絶対的な法治主義をもって世界に君臨し、',

	'少々窮屈ではあったが、平和でおだやかな時間が流れた',
	'',
	
	'しかし、ここ数年のあいだに、',
	'皇帝のやり方は一変してしまった',
	'力による支配、民への弾圧、',
	
	'そして・・・邪教の復活、',
	'ロプト教団の勢力は今や世界をおおわんばかり',
	
	'いけにえの儀式も復活し、',
	'ロプト神の復活祭に向けて、',
	'世界中で子供狩りが行われている',
	
	'それに反抗したものはみな捕らえられて、',
	'奴隷となったり処刑されたり、',

	'まさに、あの忌まわしいロプト帝国が、',
	'再建されようとしているのだ',
	]],
	['092', a, [
	'そんな・・・！',
	'噂には聞いていたけど・・・',
	'まさか本当だったとは・・・',
	]],
	['101', a, [
	'イザークはまだいいほうだ',
	'ダナンの二人の息子は、',
	'子供狩りだけは承知しなかったらしい',
	]],
	['102', a, [
	'・・・・・・',
	]],
	['011', a, [
	'世界では今、各地で反乱が起こっているが、',
	'どれもまとまりなく、',
	
	'帝国の圧倒的な戦力の前に叩きつぶされている',

	'世界は救世主を必要としているのだ',
	'',
	'わかるか、セリスよ、',
	'おまえが世界を救わねばならぬ',
	
	'それができるのはおまえしかいないのだ',
	]],
	['152', a, [
	'待って下さい',
	'ぼくにはそんな力は・・・',
	]],
	['161', a, [
	'おまえには、その義務がある',
	'',
	'おまえは皇女ディアドラの第一子、',
	'つまり、ユリウス皇子の兄に当たる',
	
	'聖者ヘイムの直系として、',
	'聖戦士たちをまとめ、世界を闇から救う義務があるのだ',
	]],
	['172', a, [
	'それは・・・',
	]],
	['181', a, [
	'それに、力もある',
	'まだ、目覚めてはいないが、おまえは聖騎士バルドの末裔',
	
	'聖剣ティルフィングを手にすれば、',
	'その力は天にもとどくはずだ',
	]],
	['192', a, [
	'でも・・・',
	]],
	['201', a, [
	'そして、最後に神の意志',

	'',
	'おまえは、非業の死をとげたシグルドの子として、',
	'その遺志を継がねばならぬ',
	
	'もはや、迷うときではない',
	'わかるなセリス',
	]],
	['222', a, [
	'はい・・・わかりました',
	'それが私の運命なら、私は行きます',
	'神の御心のおもむくままに・・・',
	]],
	['231', a, [
	'運命は一つではない',
	'お前だけのものでもない',
	'それはいずれわかるときもくるだろう',
	
	'',
	'シグルドはお前に多くのものを残した',
	'その最たるものが、友、だ',
	'私がおまえと共にあるのも、そのひとつ',
	
	'多くの若者が、おまえのもとに集うのも、',
	'父の優しさゆえと、感謝するのだ',
	]],
	['252', a, [
	'はい、父は多くの人から愛され、信頼されました',
	'私も、そうありたいと願っています',
	]],
	['261', a, [
	'ならばよし',
	'',
	'では、次なる目的はレンスターだな',

	'シグルドの親友だったキュアンの子が、',
	'レンスターで兵を挙げたが苦戦している',
	'彼らを救わねばならない',
	
	'イザークの守りは、この国の者たちにまかせて、',
	'すぐに出発だ',
	'シャナン王子とは途中で合流すればいい',
	]],
	['282', a, [
	'はい！',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
