from .params import *
scene_dir = [
	'14-ラクチェ-ヨハン/',
	'15-ラクチェ-ヨハルヴァ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : 斧兄弟'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['', a, [
		'vsヨハン',
	]],
	
	['006', bat,[]],
	
	['005', a, [
	'ふふふ・・・',
	'私に勝てる者などいない',

	'私の手にかかって死ねる事を喜ぶがいい',
	]],
	
	['', a, [
		'ラクチェvsヨハン',
	]],
	['026', bat,[]],
	['025', a, [
	'ま、待ってくれ、ラクチェ！',
	'私はお前とは戦いたくない！',
	]],
	
	['', a, [
		'ヨハンの最期',
	]],
	
	['035', a, [
	'ああ、反乱軍ごときに敗れるとは・・・',
	'ラクチェ、わが愛は、永遠なり・・・',
	]],
	
	['改ページ', -1, ['']],
	
	['', a, [
		'vsヨハルヴァ',
	]],
	
	['146', bat,[]],
	
	['145', a, [
	'俺様の城はわたさねえぞ！',
	'反乱軍どもめ、ぶちのめしてやる！',
	]],
	
	['', a, [
		'ラクチェvsヨハルヴァ',
	]],
	['156', bat,[]],
	['155', a, [
	'ま、待てよラクチェ',
	'俺はお前とは戦いたくないんだ！',
	]],
	
	['', a, [
		'ヨハルヴァの最期',
	]],
	['165', a, [
	'うう・・・ラクチェ・・・',
	'すまねぇ・・・',
	]],
	
	['', a, [
		'ヨハンvsヨハルヴァ',
	]],
	['123', a, [
	'ふっ、ヨハルヴァか',
	'愚かな弟を持って私は悲しいぞ',
	]],
	['124', a, [
	'バカなのは貴様の方だが、まあいいや',
	'いつかこんな日がくると思っていたぜ！',
	'今日こそ決着をつけてやろう！',
	]],
	['133', a, [
	'おお、望むところだ！',
	]],

	['改ページ', -1, ['']],
	
	['', a, [
		'会話：ラクチェ→ヨハン',
	]],
	
	['043', a, [
	'ああ、ラクチェ・・・我が愛しの人よ',
	'ついに運命の日は来たり・・・',
	]],
	['044', a, [
	'ヨハン？　何を言っているの？',
	'何か悪い物でもたべたのか？',
	]],
	['053', a, [
	'ラクチェ・・・',
	'君の言葉は小鳥のさえずり',
	'君の瞳は、星の瞬き',

	'ああ、もはや君なしでは生きてはいけない・・・',
	]],
	['064', a, [
	'やめろ！、気持ちが悪い！',
	'ここは戦場なのだぞ',
	'とても正気とは思えない',
	]],
	['073', a, [
	'私の心が、偽りではない証拠をみせる',
	'愛は時に、人を狂わせるものなのだ',
	
	'全軍に告ぐ',
	'これより我が軍は、解放軍に協力する！',

	'今日から我らは、愛と正義と、',
	'ラクチェのために戦うのだ！！',
	]],
	['', a, [
	'',
	]],
	['104', a, [
	'ちくしょう、ヨハン兄貴め！',
	'抜け駆けしてラクチェの味方につきやがった',

	'こうなったら、戦ってやるぜ！',
	'全軍、攻撃にうつれ！',
	]],
	
	['改ページ', -1, ['']],
	
	['', a, [
		'会話：ラクチェ→ヨハルヴァ',
	]],
	
	['173', a, [
	'ラクチェじゃねえか！',
	'俺に会いたくなって、ここまで来たのか？',
	]],
	['174', a, [
	'ふふっ、ヨハルヴァ・・・相変わらずね',
	'あなたは荒くれだけど、確かに悪い人じゃない',
	
	'少なくとも、女、子供に手出しはしなかったもの',

	'わたしだって、できることなら戦いたくはないわ',
	]],
	['203', a, [
	'俺は、兄貴達みたいにクールじゃねえよ',
	'力でごり押しするのは好きじゃねえんだ',
	
	'それに、ロプト教団のやり方には、もう我慢できねえ',

	'国じゃ、罪もない子供達を生贄にしているって言うし、',

	'それに文句一つ言えねえ親父にも愛想が尽きた',

	'ラクチェが望むなら、俺の部隊ごとおまえにくれてやらあ',
	]],
	['244', a, [
	'え！　・・・本気なの？',
	'ヨハルヴァ、あんたって人は・・・',

	'ごめんなさい',
	'いままで少し誤解してたみたい',
	]],
	['263', a, [
	'いいさ、確かに酷いこともやってきた',
	'その罪滅ぼしもあるし、やってやるぜ',

	'おおしっ、今日から俺らは解放軍だ！',
	'てめえら、愛と正義のために戦おうぜ！！',
	]],
	['', a, [
	'',
	]],
	['284', a, [
	'ヨハルヴァが解放軍についただと？',
	'くっ・・・ヨハルヴァめ、抜け駆けしおって！',
	
	'ええい、全軍、攻撃開始だ',
	]],
	
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
