from .params import *
scene_dir = [
	#'81-セリス軍',
	#'81-セリス軍2',
	#'82-ハロルド軍',
	#'83-リボー軍',
	'84-ヨハン軍',
	'85-ヨハルヴァ軍',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : ヨハン軍vsヨハルヴァ軍' 

persons = {
	'ヨハン'  : '00',
	'ヨハルヴァ'  : '11',
}

organization = {
	'左' : {
		'名' : 'ヨハン軍(11)',
		'指揮官' : persons['ヨハン'],
		'編成' : [
			['アクスナイト(10)', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10]],
		],
	},
	'右' : {
		'名' : 'ヨハルヴァ軍(11)',
		'指揮官' : persons['ヨハルヴァ'],
		'編成' : [
			['アクスファイター(10)', [11,12,13,14,15,16,17,18]],
			['', [19,20]],
		],
	},
}
