from .params import *
scene_dir = [
	'81-セリス軍',
	'81-セリス軍2',
	'81-セリス軍3',
	'86-シュミット軍',
	'84-ヨハン軍',
	'85-ヨハルヴァ軍',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : vsシュミット軍' 

persons = {
	'セリス'  : '00',
	'シュミット'  : '10',
}

organization = {
	'左' : {
		'名' : 'セリス軍(10)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['', [1,2,3]],
			['', [4,5,6]],
			['ガネーシャ城制圧後', [7]],
			['リボー軍進軍後', [8,9]],
		],
	},
	'右' : {
		'名' : 'シュミット軍(34)',
		'指揮官' : persons['シュミット'],
		'編成' : [
			['アクスナイト(11)', [11,12,13,14,15,16,17,18]],
			['', [19,20,21]],
			['ヨハン', [22]],
			['アクスナイト(10)', [23,24,25,26,27,28,29,30]],
			['', [31,32]],
			['ヨハルヴァ', [33]],
			['アクスファイター(10)', [34,35,36,37,38,39,40,41]],
			['', [42,43]],
		],
	},
}
