from .params import *
scene_dir = [
	'81-セリス軍',
	'81-セリス軍2',
	'82-ハロルド軍',
	'83-リボー軍',
	#'84-ヨハン軍',
	#'85-ヨルヴァ軍',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsハロルド軍' 

persons = {
	'セリス'  : '00',
	'ハロルド'  : '07',
}

organization = {
	'左' : {
		'名' : 'セリス軍(7)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['', [1,2,3]],
			['3ターン経過', [4,5,6]],
		],
	},
	'右' : {
		'名' : 'ハロルド軍(29)',
		'指揮官' : persons['ハロルド'],
		'編成' : [
			['アクスアーマー(7)', [8,9,10,11,12,13,14]],
			['ボウアーマー(4)', [15,16,17,18]],
			['アクスファイター(12)', [19,20,21,22,23,24,25,26]],
			['', [27,28,29,30]],
			['マウンテンシーフ(5)', [31,32,33,34,35]],
		],
	},
}
