from .params import *
scene_dir = [
	'00-プロローグ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]
#files = []

org_im = [24]

title = 'プロローグ'
a = 0.5

scene = [ 
	['00', a, [
	'王都バーハラでの激しい戦いは、',
	'有力諸公のほとんどを死においやり、',
	]],
	['01', a, [
	'アルヴィス卿は自らが計画した通りに、',
	'王国の全権を手に入れることとなった',
	]],
	['02', a, [
	'彼は敵対するシレジア、レンスターの',
	'両王国を滅亡させて大陸を統一し、',
	'国民の圧倒的な支持によって、',
	
	'グランベル帝国初代皇帝となったのである',
	]],
	['05', a, [
	'そしてバーハラの戦いから',
	'十七年の時が流れた',
	]],
	
	['改ページ', -1, ['']],
	
	['06', a, [
	'かつてはアルヴィス皇帝を',
	'熱狂して迎えた人々も、',
	
	'今ではその圧政にあえぎ苦しみ、',
	
	'また、帝国の支配下にある地方の国々では、',
	
	'人々はまるで奴隷のような生活を',
	'強いられていた',
	]],
	['10', a, [
	'ここイザークでも、',
	'人々の苦しさは限界に達していた',
	]],
	['11', a, [
	'イザーク王ダナンは、',
	'父親であるランゴバルト公爵に似て',
	'残虐な男であった',
	
	'彼はイザークの民を奴隷身分に落とし、',
	
	'みずからはリボーの王宮で',
	'快楽に溺れながらも、',
	]],
	['15', a, [
	'次男ヨハンをイザーク城に、'
	'三男ヨハルヴァをソファラ城に、',
	]],
	['16', a, [
	'また辺境のガネーシャ城には、',
	'腹心であるハロルド将軍をおいて、',
	
	'住民をきびしく弾圧していたのである',
	]],
	['18', a, [
	'だが、イザークの民には希望があった',
	]],
	['19', a, [
	'北方の隠れ里「ティルナノグ」に、',
	'シャナン王子の解放軍が結成され、',
	
	'日に日に力をつけてきた',
	]],
	['21', a, [
	'そして、彼ら若き戦士たちの中に、',
	'イザークの人々が光の公子と呼び、',
	
	'また、グランベルの皇子と敬う',
	'一人の少年の姿があった',
	]],
	['23', a, [
	'解放軍の若き盟主',
	'その名をセリスといった',
	]],
	
	['24', a, []],
	
	#['改ページ', -1, ['']],
	
	
]


