from .params import *
scene_dir = [
	'10-vsムハマド/',
	'12-vsオーヴォ/',
	'14-vs三姉妹/',
	'16-vsイシュタル/',
	'18-vsブルーム/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsコノート軍'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['', a, [
	'vsムハマド',
	]],
	['006', bat,[]],
	
	['005', a, [
	'くっ・・・反乱軍め・・・',
	]],
	
	['026', bat,[]],
	['016', bat,[]],
	
	['035', a, [
	'我らが、こうも容易く敗れるとは・・・',
	'ブルーム王よ、お許しあれ・・・',
	]],
	
	['改ページ', -1, ['']],
	
	['', a, [
	'vsオーヴォ',
	]],
	['046', bat,[]],
	
	['045', a, [
	'なかなかやるな',
	'しかしそれも、ここまでだ！',
	]],
	
	['056', bat,[]],
	['066', bat,[]],
	['076', bat,[]],
	
	['085', a, [
	'ば、ばかな・・・',
	]],
	
	['改ページ', -1, ['']],
	
	['', a, [
	'vs三姉妹',
	]],
	['096', bat,[]],
	['095', a, [
	'くらえ！　エルサンダー！！',
	]],
	['145', a, [
	'ヴァンパ、フェトラ・・・',
	'これまでだな・・・',
	]],
	
	['106', bat,[]],
	['105', a, [
	'くらえ！　エルウインド！！',
	]],
	['125', a, [
	'くっ・・・反乱軍め・・・',
	]],
	
	['116', bat,[]],
	['115', a, [
	'くらえ！　エルファイアー！！',
	]],
	['135', a, [
	'ああ、無念だ・・・',
	'フェトラ、エリウ・・・',
	]],
	
	['改ページ', -1, ['']],
	
	['', a, [
	'vsイシュタル',
	]],
	['156', bat,[]],
	
	['155', a, [
	'すまない・・・死んでもらう！',
	'トールハンマー！！',
	]],
	
	['166', bat,[]],
	['176', bat,[]],
	
	['185', a, [
	'ああ・・・ユリウス様・・・',
	]],
	
	['190', fld,[]],
	['200', fld,[]],
	
	['213', a, [
	'イシュタルよ、私とともにバーハラへ戻れ',
	'おまえはこんなところで死んではならぬ',
	]],
	['214', a, [
	'あっ、ユリウスさま・・・',
	'でも、どうして・・・',
	]],
	['223', a, [
	'私にはおまえが必要だ',
	'私の力になってくれ',
	]],
	['224', a, [
	'は、はい！　喜んで・・・ユリウスさま',
	]],
	
	['230', fld,[]],
	['240', fld,[]],
	
	['', a, [
	'ティニーvsイシュタル',
	]],
	
	['253', a, [
	'あら、あなたはティニーね',
	'どうして敵に？',
	]],
	['254', a, [
	'イシュタル姉様！？',
	'ご、ごめんなさい・・・',
	]],
	['263', a, [
	'そう、裏切ったのね・・・',
	'見損なったわ、ティニー！',
	]],
	
	['', a, [
	'(平民)リンダvsイシュタル',
	]],
	['273', a, [
	'あら、あなたはリンダね',
	'どうして敵に？',
	]],
	['274', a, [
	'イシュタル姉様！？',
	'ご、ごめんなさい・・・',
	]],
	['283', a, [
	'そう、裏切ったのね・・・',
	'見損なったわ、リンダ！',
	]],
	
	['改ページ', -1, ['']],
	
	['', a, [
	'vsブルーム',
	]],
	['296', bat,[]],
	
	['295', a, [
	'くっ・・・これは一体どうしたことだ',
	'貴様ら・・・許さんぞ！',
	]],
	['306', bat,[]],
	['376', bat,[]],
	['386', bat,[]],
	
	['395', a, [
	'ぐぐっ・・・無念だ・・・',
	]],
	
	
	['', a, [
	'ファバルvsブルーム',
	]],
	['313', a, [
	'き、貴様はファバル！',
	'おのれ！裏切ったな！！',
	]],
	['314', a, [
	'すまねえな',
	'よく考えてみれば、あんたに手を貸すなんてまっぴらだ',
	'悪いが死んでもらうぜ',
	]],
	['323', a, [
	'くっ、どいつもこいつも・・・',
	]],
	
	['', a, [
	'ティニーvsブルーム',
	]],
	['333', a, [
	'ティニーか・・・この恩知らずめ！',
	]],
	['334', a, [
	'でも、お母さまを市に追いやったのは、あなたです',
	'忘れたとは言わせません！',
	]],
	['343', a, [
	'くっ、くそ・・・',
	]],
	
	['', a, [
	'セリスvsブルーム',
	]],
	['353', a, [
	'き、貴様はシグルドの・・・',
	'小僧、貴様だけは生かしておかん！',
	]],
	['354', a, [
	'ブルーム王、それは私の言葉だ',
	'もはや逃げられない、諦めろ',
	]],
	['363', a, [
	'く、くそ・・・ほざくな小僧！',
	'この上は貴様も道連れだ！',
	]],
	
	['', a, [
	'アサエロvsブルーム',
	]],
	['403', a, [
	'き、貴様はアサエロ！',
	'おのれ！裏切ったな！！',
	]],
	['404', a, [
	'すまねえな',
	'よく考えてみれば、あんたに手を貸すなんてまっぴらだ',
	'悪いが死んでもらうぜ',
	]],
	['413', a, [
	'くっ、どいつもこいつも・・・',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
