from .params import *
scene_dir = [
	'30-vsコルータ/',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : vsコルータ軍'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['', a, [
	'vsコルータ',
	]],
	['006', bat,[]],
	
	['005', a, [
	'ふふふ・・・',
	'悪いが、死んでもらうぞ',
	]],
	
	#['016', bat,[]],
	['026', bat,[]],
	['036', bat,[]],
	
	['045', a, [
	'トラキアに栄光あれ！',
	'・・・ぐふっ',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
