from .params import *
scene_dir = [
	'34-vsマイコフ/',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : vsマイコフ軍'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['', a, [
	'vsマイコフ',
	]],
	['006', bat,[]],
	
	['005', a, [
	'この土地は我らのものだ',
	'貴様たちに奪われてたまるか',
	]],
	
	['016', bat,[]],
	['026', bat,[]],
	#['036', bat,[]],
	
	['045', a, [
	'トラキアばんざい！',
	'・・・ぐふっ',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
