from .params import *
scene_dir = [
	'81-セリス軍',
	#'82-リーフ軍',
	#'81a-セリス軍',
	#'82a-リーフ軍',
	
	#'83-ブルーム軍',
	#'84-オーヴォ軍',
	'85-ムハマド軍',
	#'86-ミーズ軍',
	#'87-ファバル',
	#'87a-アサエロ',
	#'88-イシュタル',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsムハマド軍' 
#title = 'Phase1(平民) : vsムハマド軍' 

persons = {
	'セリス'  : '00',
	'ムハマド'  : '16',
}

organization = {
	'左' : {
		'名' : 'セリス軍(16)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10,11,12]],
			['', [13,14,15]],
		],
	},
	'右' : {
		'名' : 'ムハマド軍(15)',
		'指揮官' : persons['ムハマド'],
		'編成' : [
			['ビショップ(1)', [17]],
			['サンダーマージ(3)', [18,19,20]],
			['ボウアーマー(4)', [21,22,23,24]],
			['アーマー(6)', [25,26,27,28,29,30]],
		],
	},
}
