from .params import *
scene_dir = [
	#'81-セリス軍',
	#'82-リーフ軍',
	#'87-ファバル',
	'81a-セリス軍',
	'82a-リーフ軍',
	'87a-アサエロ',
	
	'90-アルテナ軍',
	#'89-ミーズ軍',
	'91-セティ',
	'91a-ホーク',
	
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

#title = 'Phase2 : セティvsコルータ軍' 
title = 'Phase2(平民) : ホークvsコルータ軍' 

persons = {
	#'セティ'  : '30',
	'ホーク'  : '37',
	'アルテナ'  : '20',
}

organization = {
	'左' : {
		#'名' : 'セティ',
		#'指揮官' : persons['セティ'],
		'名' : 'ホーク',
		'指揮官' : persons['ホーク'],
		'編成' : [
			['', [31,32,33,34]],
			['', [35,36]],
		],
	},
	'右' : {
		'名' : 'コルータ軍(10)',
		'指揮官' : persons['アルテナ'],
		'編成' : [
			['コルータ', [21]],
			['ドラゴンライダー(8)', [22,23,24,25,26,27,28,29]],
		],
	},
}
