from .params import *
scene_dir = [
	#'81-セリス軍',
	'82-リーフ軍',
	#'81a-セリス軍',
	#'82a-リーフ軍',
	
	#'83-ブルーム軍',
	'84-オーヴォ軍',
	#'85-ムハマド軍',
	#'86-ミーズ軍',
	#'87-ファバル',
	#'87a-アサエロ',
	#'88-イシュタル',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsオーヴォ軍'
#title = 'Phase1(平民) : vsオーヴォ軍' 

persons = {
	'リーフ'  : '00',
	'オーヴォ'  : '03',
}

organization = {
	'左' : {
		'名' : 'リーフ軍(3)',
		'指揮官' : persons['リーフ'],
		'編成' : [
			['', [1,2]],
		],
	},
	'右' : {
		'名' : 'オーヴォ軍(12)',
		'指揮官' : persons['オーヴォ'],
		'編成' : [
			['トルバドール(5)', [4,5,6,7,8]],
			['ランスナイト(6)', [9,10,11,12,13,14]],
		],
	},
}
