from .params import *
scene_dir = [
	'81-セリス軍',
	'82-リーフ軍',
	'87-ファバル',
	#'91-セティ',
	#'81a-セリス軍',
	#'82a-リーフ軍',
	'87a-アサエロ',
	
	
	#'90-アルテナ軍',
	'89-ミーズ軍',
	
	'91-セティ',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : vsマイコフ軍' 
#title = 'Phase3(平民) : vsマイコフ軍' 

persons = {
	'セリス'  : '00',
	'マイコフ'  : '21',
}

organization = {
	'左' : {
		'名' : 'セリス軍(21)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10,11,12]],
			['', [13,14,15,16]],
			['', [17,18,19,48]],
		],
	},
	'右' : {
		'名' : 'マイコフ軍(27)',
		'指揮官' : persons['マイコフ'],
		'編成' : [
			['ドラゴンナイト(隊長)', [22]],
			['ドラゴンライダー(9)', [23,24,25,26,27,28,29,30]],
			['', [31]],
			['アイアンアーチ(隊長)', [32]],
			['ロングアーチ(5)', [33,34,35,36,37]],
			['ドラゴンナイト(隊長)', [38]],
			['ドラゴンライダー(9)', [39,40,41,42,43,44,45,46]],
			['', [47]],
		],
	},
}
