from .params import *
scene_dir = [
	'81-セリス軍',
	'82-リーフ軍',
	#'81a-セリス軍',
	#'82a-リーフ軍',
	
	'83-ブルーム軍',
	#'84-オーヴォ軍',
	#'85-ムハマド軍',
	'86-ミーズ軍',
	'87-ファバル',
	#'87a-アサエロ',
	'88-イシュタル',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsブルーム軍' 
#title = 'Phase1(平民) : vsブルーム軍' 

persons = {
	'セリス'  : '00',
	'ブルーム'  : '19',
}

organization = {
	'左' : {
		'名' : 'セリス軍(19)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10,11,12]],
			['', [13,14,15]],
			['レンスター城救援', [16,17,18]],
		],
	},
	'右' : {
		'名' : 'ブルーム軍(21)',
		'指揮官' : persons['ブルーム'],
		'編成' : [
			['ジェネラル(3)', [20,21,22]],
			['フェトラ、ヴァンパ、エリウ', [23,23,25]],
			['サンダーマージ(3)', [26,27,28]],
			['ジェネラル(隊長),アーマー(3)', [29,30,31,32]],
			['マウンテンシーフ(4)', [33,34,35,36]],
			['シーフファイター(1)', [37]],
			['(3ターン経過)ファバル', [38]],
			#['(3ターン経過)アサエロ', [38]],
			['(5ターン経過)イシュタル', [39]],
		],
	},
}
