from .params import *
scene_dir = [
	'81-セリス軍',
	'82-リーフ軍',
	'87-ファバル',
	#'81a-セリス軍',
	#'82a-リーフ軍',
	#'87a-アサエロ',
	
	'90-アルテナ軍',
	#'89-ミーズ軍',
	#'91-セティ',
	#'91a-ホーク',
	
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : vsコルータ軍' 
#title = 'Phase2(平民) : vsコルータ軍' 

persons = {
	'セリス'  : '00',
	'アルテナ'  : '20',
}

organization = {
	'左' : {
		'名' : 'セリス軍(20)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10,11,12]],
			['', [13,14,15,16]],
			['', [17,18,19]],
		],
	},
	'右' : {
		'名' : 'コルータ軍(10)',
		'指揮官' : persons['アルテナ'],
		'編成' : [
			['コルータ', [21]],
			['ドラゴンライダー(8)', [22,23,24,25,26,27,28,29]],
		],
	},
}
