from .params import *
scene_dir = [
	'00-プロローグ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]
#files = []

org_im = [23]

title = 'プロローグ'
a = 0.5

scene = [ 
	
	
	['00', a, [
	'トラキア半島は二つの顔を持っている。',
	]],
	['01', a, [
	'北半島は豊かな大草原に、',
	'多くの小王国が分立し、',
	]],
	['02', a, [
	'南半島は険しい山々と不毛の大地に、',
	'竜騎士で知られるトラキア王国がある。',

	'',
	'蛮勇をもって知られるトラキアは、',
	]],
	['04', a, [
	'北の豊かな土地を手にいれるため、',
	'過去より何度も侵入をくり返してきたが、',
	]],
	['05', a, [
	'レンスター王家の抵抗によって、',
	'失敗をくりかえしてきた。',
	
	'',
	'イード砂漠でレンスター軍を壊滅させ、',
	'ようやく野望は達成されたかに見えたが、',
	]],
	['07', a, [
	'フリージ家のブルーム公子が、',
	'大軍をもってこの地方を制圧、',
	]],
	['08', a, [
	'以後、北トラキア王国として、',
	'帝国の支配下におかれたのである。',
	
	'',
	'それから十数年、',
	'野心家のトラバント王も、',
	
	'帝国の武力の前には、',
	'なんら手出しのしようもなく、',

	'不思議な平和が保たれていた。',

	'',
	'しかし、',
	'解放軍による王都アルスターの制圧は、',
	
	'この地方の微妙なバランスに変化を与えた。',
	]],
	['14', a, [
	'アルスター城、レンスター城は、',
	'セリスの解放軍が支配し、',
	]],
	['15', a, [
	'コノート城ではアルスターから、',
	'落ち延びたブルーム王が兵を集め、',
	]],
	['16', a, [
	'マンスター城では、',
	'雷神の異名で知られるイシュタル王女が、',
	
	'トラキアに対する守りを固め、',
	]],
	['18', a, [
	'トラキア領ミーズでは国王トラバントが、',
	
	'前線司令官のマイコフ将軍とともに、',
	'不気味な沈黙を守っていた',
	
	'',
	'人々の願いはただ一つ、',

	'この地方が、',
	'再びレンスター王家の支配に戻ること。',
	
	'そして、戦いの幕は上がった。',
	]],

	['23', a, []],
	]


