from .params import *
scene_dir = [
	'15-vsヴァハ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : vsヴァハ'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['006', bat,[]],

	['005', a, [
	'くらえ、天の怒り！',
	'メティオ！！',
	]],
	
	['016', bat,[]],
	['026', bat,[]],
	
	['035', a, [
	'ううっ・・・アルヴィス様、',
	'お許しを・・・',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
