from .params import *
scene_dir = [
	'16-vsマゴーネ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : vsマゴーネ'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['006', bat,[]],

	['005', a, [
	'これも我らの仕事なのでな',
	'・・・悪く思うなよ',
	]],
	
	['026', bat,[]],
	['036', bat,[]],
	
	['045', a, [
	'ぐっ・・・トラキアに栄光あれ！',
	]],

	['', a, [
	'シグルドvsマゴーネ',
	]],
	
	['015', a, [
	'・・・お前がシグルドだな',
	'ふふふ・・・哀れな奴よ・・・',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
