from .params import *
scene_dir = [
	'25-vsレプトール/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : vsレプトール'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['', a, [
	'vsレプトール(戦闘開始)',
	]],
	
	['006', bat,[]],
	['005', a, [
	'くくく・・・',
	'トールハンマーの恐ろしさ、とくと思い知るがよい！',
	]],
	
	['', a, [
	'アイーダvsレプトール',
	]],
	['143', a, [
	'アイーダ・・・',
	'貴様、よくも裏切ったな・・・',
	]],
	['144', a, [
	'ほっほっほ・・・',
	'レプトール卿も往生際が悪い',
	'もはやあきらめる事ですね',
	]],
	
	['', a, [
	'vsレプトール(アイーダ離反後)',
	]],
	['195', a, [
	'この上は、きさまも道連れだ！',
	'死ね！！',
	]],
	
	['', a, [
	'ティルテュvsレプトール',
	]],
	['013', a, [
	'ティ、ティルテュ・・・',
	'お前なのか・・・',

	'反乱軍にいるとはきいたが、',
	'まさかわしの前にあらわれるとは・・・',
	]],
	['024', a, [
	'お父さま・・・ごめんなさい・・・',
	]],
	['033', a, [
	'くっ、クロードめ！',
	'娘をたぶらかしおって・・・',

	'やむをえぬな・・・',
	'フリージ家の名誉を守るために、',
	'ティルテュよ、お前には死んでもらうぞ',
	]],
	['044', a, [
	'！　・・・・・・お父さま・・・'
	]],
	
	['', a, [
	'シグルド→アイーダ',
	]],
	['133', a, [
	'話をしているときではありません',
	'レプトールを倒してから、シグルド様がおいで下さい',
	]],
	
	['', a, [
	'シグルドvsレプトール',
	]],
	['053', a, [
	'シグルド！？　・・・この反逆者め！',
	'聖地をおかすつもりか！',
	]],
	['054', a, [
	'レプトール卿、反逆者はあなただ！',

	'我が父を陥れ、クルト皇子を手にかけた',
	'身に覚えがあるだろう！',
	]],
	['073', a, [
	'ふん、バカめ！　政治とは力だ！',
	'おまえの父は力がなかったから死んだまでの事',

	'おまえも騎士なら、それくらいはわかるだろう',
	]],
	['084', a, [
	'騎士は正義と名誉を重んじる者、',
	'あなたのやり方に正義などはない',

	'私はグランベルの名誉を取り戻すために、',
	'祖国に帰ってきたのだ！',
	]],
	['103', a, [
	'ご苦労なことだが、それもここまでだな',
	'おまえもバイロンと同じように、',
	'反逆者として死ぬのだよ',
	
	'わがトールハンマーの前には、',
	'おまえの力など通用しない',

	'シグルドよ、自分の無力を思い知れ',
	'わっはっは・・・',
	]],
	
	
	['156', bat,[]],
	['166', bat,[]],
	['176', bat,[]],
	
	['185', a, [
	'くっ・・・アルヴィスめ',
	'・・・ヤツはいったい・・・ぐふっ',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
