from .params import *
scene_dir = [
	'12-キュアンの最期/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : キュアンの最期'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['', a, [
	'エスリンvsトラキア軍',
	]],
	['004', a, [
	'アルテナ、あなただけは、この私が守ります！',
	]],
	
	['', a, [
	'キュアンvsトラキア軍',
	]],
	['014', a, [
	'しね！　ハイエナどもめ！！',
	'このゲイボルグあるかぎり、お前達には、負けはしない',
	]],
	
	['', a, [
	'エスリン死亡',
	]],
	['024', a, [
	'ああ、アルテナ・・・許して・・・',
	'キュアン、ごめんなさい・・・',
	]],
	['034', a, [
	'なに？',
	'敵の女が、子供を連れていただと・・・',
	'キュアンの娘だな・・・これは面白い',
	
	'ヤツに言え、',
	'ゲイボルグを捨てろ、さもないと娘を殺すとな',
	
	'・・・ふふふっ',
	'あの男のことだ、イヤとは言えまいよ',
	]],
	['064', a, [
	'なに！　アルテナが・・・',
	'そうか・・・エスリンは・・・',
	'',
	'わかった・・・もはやこれまでだな・・・',
	
	'ゲイボルグは捨てる',
	'だから、娘に手を触れるなと言え！',
	]],
	
	['', a, [
	'キュアン死亡',
	]],
	['084', a, [
	'エスリン・・・すまない・・・',
	'フィン、リーフを頼むぞ・・・',
	]],
	['093', a, [
	'キュアンめ、死んだか・・・',
	'よし、マゴーネ、',
	'貴様は部下を率いてシグルド軍を襲え',
	
	'ヤツらの首には高い賞金がかかっている',
	'一人も討ちもらすなよ',
	]],
	['104', a, [
	'はっ、ところであの子供はどうします？',
	'ひどく泣き叫ぶもので、皆な手を焼いております',
	
	'ひと思いに殺しますか？',
	]],
	['123', a, [
	'それにはおよばん、わしによこせ',
	'わしがゲイボルグの槍と共に、トラキアへ連れて帰る',
	]],
	['124', a, [
	'これは意外なことを・・・',
	'トラキアへ連れ帰ってどうなさるのです？',
	]],
	['133', a, [
	'ばかもの！　貴様には関係のないことだ！！',
	'よけいなことに口を出すな！！',
	]],
	['134', a, [
	'ははっ、申し訳ございません',
	'では私は、シグルド軍追撃に向かいます',
	]],
	['143', a, [
	'うむっ、たのんだぞ！▼',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
