from .params import *
scene_dir = [
	'28-エピローグ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : エピローグ'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['006', bat,[]],
	
	['', a, [
	'かくして、ひとつの時代は終わった',
	'',

	'イザークへの遠征に端を発したグランベルの動乱は、',
	'一人の若者を数奇な運命へと導き、',
	'そして、いくたの悲しい物語と共に儚くも消えた',
	'',

	'戦い途上において、傷つき倒れた者',
	'',

	'レンスターの王子、キュアン',
	'',

	'その妻、エスリン',
	'',

	'そしてシアルフィの公子、シグルド',
	]],
	
	['改ページ', -1, ['']],
	
	['', a, [
	'また、最後までシグルドと共にありながら、',
	'バーハラでの戦いに敗れて生死不明の者',
	'',

	'シアルフィの騎士、ノイッシュ',
	
	'シアルフィの騎士、アレク',
	
	'シアルフィの重騎士、アーダン',
	
	'ドズルの公子、レックス',
	
	'ヴェルトマーの公子、アゼル',
	
	'イザークの王女、アイラ',
	
	'ユングヴィの公女、エーディン',
	
	'ユングヴィの弓騎士、ミデェール',
	
	'ヴェルダンの王子、ジャムカ',
	
	'ノディオンの王女、ラケシス',
	
	'自由騎士、ベオウルフ',
	
	'剣闘士、ホリン',
	
	'盗賊、デュー',
	
	'シレジアの王子、レヴィン',
	
	'シレジアの天馬騎士、フュリー',
	
	'旅の踊り子、シルヴィア',
	
	'エッダの司祭、クロード',
	
	'フリージの公女、ティルテュ',
	
	'ユングヴィの公女、ブリギッド',
	'',

	'若者達は、理想を求めて戦った',
	'しかし、その夢も叶わぬまま戦場に散った',

	'彼らの戦いがいったい何であったのか',
	'',

	'そして、光は・・・・・・・・',
	
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
