from .params import *
scene_dir = [
	'05-vsスレイダー/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsスレイダー'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['006', bat,[]],

	['005', a, [
	'なに、なぜおまえたちがここにいる？',

	'すでに前線は突破されたというのか！？',
	]],
	
	['036', bat,[]],
	['046', bat,[]],
	
	['025', a, [
	'くそっ、ぬかったわ・・・',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
