from .params import *
scene_dir = [
	'10-リューベック城制圧後/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : リューベック城制圧後'

a = 1
fld = 0.5
bat = 0.75

scene = [

	['', a, [
	'レンスターの援軍',
	]],
	
	['000', fld,[]],
	['010', fld,[]],
	['020', fld,[]],
	
	['034', a, [
	'みんな、もう少しの辛抱だ',
	'がんばってくれ',

	'シグルド軍はこのイード砂漠を南下しているときく',

	'我らが北上すれば砂漠のどこかで合流できるはずだ',
	]],
	['063', a, [
	'キュアン、本当にごめんなさいね',

	'父上は病身でありながら、',
	'兄上を助けるために兵を出すことを',
	'こころよく承知して下さった',
	
	'でも、大国グランベルを敵にして、',
	'レンスター国の将来はいったいどうなるのかと思うと、',
	
	'とても心配で・・・',
	]],
	['094', a, [
	'エスリン、レンスターは小国といえども、',
	'聖戦士ノヴァの血を引く勇者の家だ',

	'これが正義の戦いならば、たとえ滅びようとも悔いはない',
	'心置きなく戦えと父上は仰せだ',
	
	'エスリン、心配するな',
	'私にはこのゲイボルグの槍がある',
	'この槍がある限り、私は負けはしない',
	
	'シグルドをきっと助けてみせる',
	]],
	['133', a, [
	'はい、そうですね・・・',
	'あなたならきっと・・・',
	]],
	['134', a, [
	'エスリン、もうそろそろ国へ戻れ',
	'このあたりは敵の勢力下にある、',
	'いつ戦いが始まるかも知れない',
	]],
	['143', a, [
	'キュアン・・・',
	'色々と考えたのだけど、',
	'やっぱり、わたしも行くことにしたの',
	
	'兄上にもお会いしたいし、',
	'それに・・・あなたの側を離れたくない',
	]],
	['154', a, [
	'それはだめだ！',
	'途中まで見送るだけだと言うから、',
	'アルテナを連れての同行を許した',

	'それでは約束が違うぞ',
	'アルテナはまだ三才、',
	'今も君のひざの上で眠っているだけだ',
	
	'もし戦いにでもなったらどうする！',
	]],
	['183', a, [
	'アルテナは、わたしの側を片時も離れないの',

	'この遠征にも連れてくるつもりはなかったけれど、',

	'泣きさけぶアルテナをおいて来れなかった',

	'',
	'でも確かにあなたが言われるとおりですね',
	'わかりました、私は国へ戻ります',
	]],
	['214', a, [
	'エスリン、すまない',
	'君の気持ちはよくわかるが、',
	'国には生まれたばかりのリーフもいる',
	
	'子供達には母親が必要だ',
	'国の守りに残したフィンとともに、',
	'私の帰りを待っていてくれ',
	]],
	['233', a, [
	'はい、でもあと少しだけ・・・',
	'少しだけでいいから・・・',
	'おそばにいさせてください',
	
	'おねがい、キュアン・・・',
	]],
	['244', a, [
	'エスリン・・・わかったよ',
	'あと、少しだけなら',
	]],
	
	['', a, [
	'トラキアの追跡',
	]],

	['250', fld,[]],
	['260', fld,[]],
	
	['274', a, [
	'くくくっ・・・キュアンめ',
	'われらが後をつけてるとも知らず、',
	'女連れとはのんきなものよ',
	
	'レンスターのランスリッターも、',
	'もはやこれまでだな',

	'砂漠に足を取られては、やつらも満足に戦えまい',

	'よし、行くぞ！',
	'トラキアの夢は今や我らが手中にある！',
	]],
	
	['310', fld,[]],
	
	['324', a, [
	'なに！？　トラキアの竜騎士団だと！',
	'くっ、しまった！',
	'トラバントに後をつけられたか！',
	
	'エスリン！！　逃げろ！',
	'砂漠の中では、我らは戦えない！',
	]],
	['343', a, [
	'で、でも・・・あなた・・・',
	]],
	['344', a, [
	'エスリン、ヤツらはハイエナだ',
	'女子供と言えども容赦はない',

	'トラキアは以前から我が国を狙っていた',

	'今回の遠征にも兵力の半分を、',
	'フィンに委ねて国に残したのは、',
	'トラキアの動きに備えての事だった',
	
	'しかしまさか、我らの後を追ってくるとは、',
	'思いもしなかった',
	
	'これは・・・私の誤りだ',
	]],
	['393', a, [
	'キュアン、あきらめないで、大丈夫よ',
	'みんなで戦えばなんとかなります',
	'最後までがんばりましょう',
	]],
	['394', a, [
	'エスリン・・・すまない・・・',
	]],
	
	['', a, [
	'',
	]],
	
	['400', fld,[]],
	
	['411', a, [
	'ランゴバルト卿が死んだか・・・',
	]],
	['412', a, [
	'ど、どうするのだ！　アルヴィス！',

	'シグルドなどたいしたことはないと言ったのは、',
	'貴公ではないか',
	
	'だからランゴバルトもわしも、',
	'兵力の大半を息子達に任せて地方の討伐に向かわせた',
	
	'これでは約束が違うではないか！',
	]],
	['451', a, [
	'レプトール卿、',
	'そうあわてることもあるまい',

	'わがヴェルトマーの手勢を、',
	'既にイード砂漠の守りに就かせてある',

	'それに、トラキアの傭兵軍団も、',
	'まもなく到着するころだ',
	'敵が疲れた頃を見計らって、',

	'公爵と私の軍団が攻撃をしかければ、',
	'シグルドの反乱軍など、たやすく撃破できる',
	]],
	['482', a, [
	'アルヴィス、約束は守れよ',
	'貴公がアズムールなき後の、',
	'グランベル王となるのはかまわぬ',
	
	'しかし我らもまた・・・',
	]],
	['501', a, [
	'わかっている',
	'この戦いが終われば貴殿のフリージ家は、',
	'アグストリアの王家となり、',
	
	'ランゴバルト卿のドズル家はイザークの王家となる',
	'約束はきっと守る、心配するな',
	]],
	['512', a, [
	'そうか・・・わかった',
	'ならばわしも、全力で戦おう・・・',
	]],
	['', a, [
	'',
	]],
	['522', a, [
	'くくくっ・・・アルヴィス卿よ',
	'計画は着々と進んでおりますな',
	]],
	['531', a, [
	'マンフロイか・・・',
	'何度も言ったが貴様たちは表に出るなよ',

	'私が実権を得るまでは、ロプト教団の影は見せてはならぬ',
	]],
	['542', a, [
	'わかっております',
	'レプトールやランゴバルトが、',
	'いくら欲の深い男であっても、',
	
	'我らの存在だけは許しはしないでしょうな',

	'ヤツらは利用するだけ利用して、',
	'捨てるのがもとよりの計画',
	'あとはヤツらの息子を使えばよいと・・・',
	]],
	['571', a, [
	'うむ・・・しかしマンフロイ、',
	'これだけは言っておく',

	'私はロプト帝国を再建するつもりなど毛頭ない',

	'お前達ロプト教団の存在はみとめるが、',
	'世界を暗黒神に委ねたりはしない',
	'忘れるなよ',
	
	'',
	'私の血の中にロプト一族の血が流れていたとしても、',

	'それは、人間のために戦った聖騎士マイラの血なのだ',

	'私は、炎の聖戦士ファラと、',
	'聖騎士マイラの血を受け継ぐ者として、',

	'この世界を、差別のない、',
	'誰もが住み易いものに変える',

	'シグルドには悪いが、',
	'彼にはそのための犠牲となってもらう',
	]],
	['642', a, [
	'ほほほ・・・',
	'それもまた、ディアドラ殿の為ですかな',
	'アルヴィス卿は恐れておられる',
	
	'お妃の記憶がもどることを・・・',
	]],
	['661', a, [
	'言うな！　マンフロイ！！',
	'私たちは愛し合っている',
	'もはや誰にも、邪魔はさせない！',
	]],
	['662', a, [
	'くくく・・・',
	'早くお子をもうけられることですな',

	'きっと立派な王になられるでしょう',
	'・・・くくくっ・・・',
	]],
	
	['改ページ', -1, ['']],
	
	['', a, [
	'フィノーラの守備',
	]],
	
	['680', fld,[]],
	
	['692', a, [
	'反逆者どもが来たか',
	'くくくっ・・・近寄れば容赦なく、',
	'メティオをお見舞いしてやれ',
	
	'この砂漠をヤツらの墓場にしてやるのだ',
	]],
	
	['710', fld,[]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
