from .params import *
scene_dir = [
	'09-リューベック城制圧/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : リューベック城制圧'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['003', a, [
	'シグルド様、激しい戦いでしたね',
	]],
	['004', a, [
	'うむ、グランベルの正規軍との戦いだ',
	'これからはもっと苦しくなるだろう',

	'',
	'そこでだ・・・オイフェ',
	'おまえに頼みがある',
	]],
	['023', a, [
	'はい、なんでしょう？',
	]],
	['024', a, [
	'このリューベックから北東に行けば、',
	'イザークの領内に入る',

	'イザークはグランベルとの戦いに敗れ、',
	'今はランゴバルトの長子、',
	'ダナンが駐留していると聞くが、',
	
	'まだ地方までは手は伸びていないだろう',
	'だから・・・',
	]],
	['053', a, [
	'待って下さい！',
	'まさか私に落ちのびろと！？',
	'それはいやです！',
	
	'私は、最後までシグルド様のおそばにいます！！',
	]],
	['064', a, [
	'オイフェ、',
	'勝手なことをと思うかもしれないが、',
	'わかってほしい',
	
	'私はセリスを失いたくないのだ',
	'この子はまだ二才にもならない',
	'こんな幼い子を連れて、私は戦えない・・・',
	
	'オイフェ、どうか頼む',
	'セリスを守ってほしい',

	'こんなことを頼めるのは、',
	'おまえしかいないのだ・・・',
	]],
	['103', a, [
	'シグルド様・・・',
	'そうですか・・・・・・わかりました',

	'セリス様は、私が命に代えてもお守りします',
	'しかし、お約束下さい',
	
	'この戦いが終われば、必ず迎えにくると、',
	'そのお約束がなければ、',
	'私は去るわけには参りません',
	]],
	['124', a, [
	'わかった、約束しよう',
	'必ず迎えに行く',
	]],
	['133', a, [
	'はい・・・そのお言葉を信じております',
	]],
	['143', a, [
	'待ってよ',
	'セリスを守るのは、ぼくの役目だ',
	'ディアドラと約束したんだ',
	
	'ディアドラがいいって言うまでは、',
	'オイフェになんかわたさないぞ！',
	]],
	['154', a, [
	'シャナン・・・もういいんだ・・・',

	'おまえはディアドラのことを、',
	'まだ、悔やんでいるようだが、',
	'もういい、気にするな',
	]],
	['173', a, [
	'いやだ！　セリスはぼくが守る',
	'イザークの民はグランベルを憎んでるから、',
	
	'オイフェたちが行っても守ってなんかくれないぞ',

	'ぼくはイザークの王子だ',
	'ぼくならセリスを守れる',
	'ディアドラとの・・・約束だもの・・・',
	]],
	['203', a, [
	'シグルド様、私も、',
	'シャナンがいてくれた方が心強いです',

	'シグルド様は、',
	'幼いシャナンを巻き込みたくないと考えておられるのでしょうが、',
	
	'彼はもう立派な戦士です',
	'イザークの人々の協力を得るためにも、',
	'シャナンの力は必要だと思います',
	]],
	['224', a, [
	'そうか・・・',

	'・・・すまないな、シャナン',
	'セリスを頼む・・・守ってやってくれ',
	]],
	['243', a, [
	'うん！　任せておいて',
	'ぼく、もっと強くなってセリスを守るから',
	
	'そして、ディアドラのこと・・・',
	'セリスに許してもらうから・・・',
	]],
	['263', a, [
	'では、シグルド様、私たちは行きます',
	'どうか、ご無事で',

	'勝利の日が一日も早く来ることを祈っています',
	]],
	['274', a, [
	'うむ、オイフェも元気でな',
	]],
	['283', a, [
	'はい！',
	]],
	['290', fld,[]],
	
	['304', a, [
	'セリス、父を許せよ・・・',
	'どうか・・・立派に育ってくれ・・・',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
