from .params import *
scene_dir = [
	'81-シグルド軍',
	#'82-ランゴバルト軍',
	#'82-ランゴバルト軍2',
	#'82-ランゴバルト軍3',
	'83-アンドレイ軍',
	#'84-スレイダー軍',
	#'85-バイロン',
	#'86-シーフ',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsアンドレイ軍' 

persons = {
	'シグルド'  : '00',
	'アンドレイ'  : '20',
}

organization = {
	'左' : {
		'名' : 'シグルド軍(20)',
		'指揮官' : persons['シグルド'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10,11,12]],
			['', [13,14,15,16]],
			['', [17,18,19]],
		],
	},
	'右' : {
		'名' : 'アンドレイ軍(8)',
		'指揮官' : persons['アンドレイ'],
		'編成' : [
			['アーチナイト(7)', [21,22,23,24,25,26,27]],
			
		],
	},
}
