from .params import *
scene_dir = [
	'81-シグルド軍',
	#'87-レンスター軍',
	#'88-トラキア軍',
	'89-フィノーラ軍',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : vsフィノーラ軍' 

persons = {
	'シグルド'  : '00',
	'フィノーラ'  : '20',
}

organization = {
	'左' : {
		'名' : 'シグルド軍',
		'指揮官' : persons['シグルド'],
		'編成' : [
			['', [2,3,4,5]],
			['', [6,7,8,9]],
			['', [10,11,12,13]],
			['', [14,15,16,17]],
			['', [18,19]],
		],
	},
	'右' : {
		'名' : 'フィノーラ軍(10)',
		'指揮官' : persons['フィノーラ'],
		'編成' : [
			['プリースト(2)', [21,22]],
			['ファイアマージ(7)', [23,24,25,26,27,28,29]],
		],
	},
}
