from .params import *
scene_dir = [
	#'81-シグルド軍',
	'87-レンスター軍',
	'88-トラキア軍',
	#'89-フィノーラ軍',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : レンスター軍vsトラキア軍' 

persons = {
	'キュアン'  : '00',
	'トラバント'  : '10',
}

organization = {
	'左' : {
		'名' : 'レンスター軍(10)',
		'指揮官' : persons['キュアン'],
		'編成' : [
		['エスリン', [1]],
		['ランスナイト(8)', [2,3,4,5]],
		['', [6,7,8,9]],
		],
	},
	'右' : {
		'名' : 'トラキア軍(15)',
		'指揮官' : persons['トラバント'],
		'編成' : [
			['マゴーネ', [11]],
			['ドラゴンナイト(13)', [12,13,14,15,16,17,18,19]],
			['', [20,21,22,23,24]],
		],
	},
}
