from .params import *
scene_dir = [
	'81-シグルド軍',
	'90-レプトール軍',
	'91-ヴェルトマー軍',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : vsレプトール軍' 

persons = {
	'シグルド'  : '00',
	'レプトール'  : '20',
}

organization = {
	'左' : {
		'名' : 'シグルド軍(20)',
		'指揮官' : persons['シグルド'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10,11,12]],
			['', [13,14,15,16]],
			['', [17,18,19]],
		],
	},
	'右' : {
		'名' : 'レプトール軍(24)',
		'指揮官' : persons['レプトール'],
		'編成' : [
			['ジェネラル(3)', [21,22,23]],
			['ボウアーマー(2)', [24,25]],
			['アーマー(3)', [26,27,28]],
			['サンダーマージ(4)', [29,30,31,32]],
			['ハイプリースト(1)', [33]],
			['スナイパー(2)', [34,35]],
			['フォーレスト(2)', [36,37]],
			['ファイヤーマージ(6)', [38,39,40,41,42,43]],
		],
	},
}
