from .params import *
scene_dir = [
	'81-シグルド軍',
	'90-レプトール軍',
	'91-ヴェルトマー軍',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : アイーダ軍vsレプトール軍' 

persons = {
	'アイーダ'  : '44',
	'レプトール'  : '20',
}

organization = {
	'左' : {
		'名' : 'アイーダ軍(7)',
		'指揮官' : persons['アイーダ'],
		'編成' : [
			['ファイヤーマージ(6)', [38,39,40,41]],
			['', [42,43]],
		],
	},
	'右' : {
		'名' : 'レプトール軍(24)',
		'指揮官' : persons['レプトール'],
		'編成' : [
			['ジェネラル(3)', [21,22,23]],
			['ボウアーマー(2)', [24,25]],
			['アーマー(3)', [26,27,28]],
			['サンダーマージ(4)', [29,30,31,32]],
			['ハイプリースト(1)', [33]],
			['スナイパー(2)', [34,35]],
			['フォーレスト(2)', [36,37]],
		],
	},
}
