from .params import *
scene_dir = [
	'00-プロローグ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]
#files = []

org_im = [16]

title = 'プロローグ'
a = 0.5

scene = [ 
	['00', a, [
	'シレジアの内乱をしずめたシグルドを、',
	'グランベルの大軍が待ち受けていた。',
	]],
	['01', a, [
	'ザクソン城を制圧したのち、',
	'シグルド達は休む間もなく、',
	]],
	['02', a, [
	'リューベック城のグランベル軍と、',
	'向き合うことになった。',
	]],
	['03', a, [
	'軍を率いるのは、父の仇の一人、',
	'ランゴバルト卿である。',

	'父バイロン卿をおとしいれた',
	'ランゴバルトとの戦いは、',
	]],
	['05', a, [
	'シグルドにとって父への弔いでもあった。',
	]],
	['06', a, [
	'砂漠の街フィノーラには、',
	'アルヴィス卿の有能なる部下、',
	]],
	['07', a, [
	'魔道剣士ヴァハが駐留し、',
	'ヴェルトマーには、',
	]],
	['08', a, [
	'アルヴィスの右腕とまでいわれた、',
	'アイーダ将軍が城を守っていた。',
	]],
	['09', a, [
	'そして、王都バーハラでは、',

	'老いて病床にあったアズムール王を、',
	'アルヴィス卿が輔け、',
	]],
	['11', a, [
	'宰相のレプトール卿が、',
	'国の治安にあたっている。',
	]],
	['12', a, [
	'王都バーハラへの道のりは遠く、',
	'討伐隊との戦いはさけられない。',

	'これ以上、世話になったシレジアを、',
	'戦いに巻き込むわけにはいかない。',

	'シグルドたちは最後の戦いを決意した。',
	'',
	'グラン暦　７６０年　早春、',
	]],
	['15', a, [
	'シレジアの山野は、',
	'いまだ深い雪におおわれていた。',
	]],

	['16', a, []],
	
	#['改ページ', -1, ['']],
	
	
]


