from .params import *
scene_dir = [
	'05-リデールゆるりと進軍/',
	'08-子供救出/',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : リデール軍進軍'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['', a, [
	'リデール軍進軍',
	]],
	
	['004', a, [
	'まあ、急ぐ必要はあるまい',
	'全軍、ゆるりと進撃せよ・・・',
	]],
	
	['', a, [
	'子供救出',
	]],
	
	['014', a, [
	'あっ、聖戦士さまぁ・・・',
	'あ〜ん、恐かったよ〜',
	]],
	['024', a, [
	'えっ、解放軍？',
	'うわぁ、来てくれたんだね！',
	]],
	['034', a, [
	'たすけてくれてありがとう',
	]],
	['044', a, [
	'え？　あなたが聖戦士？',
	'ホント？　ふーん・・・',
	]],
	['054', a, [
	'あなたが解放軍なの？',
	'へぇ〜、すてきね・・・',
	]],
	['064', a, [
	'あっ解放軍だ！　うわぁ、かっこいい！！',
	]],
	
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
