from .params import *
scene_dir = [
	'13-vsモリガン/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : vsモリガン'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['', a, [
	'vsモリガン',
	]],
	
	['006', bat,[]],
	['005', a, [
	'わが暗黒魔法の恐ろしさ',
	'とくと思い知れ！',
	]],
	['016', bat,[]],
	['026', bat,[]],
	['036', bat,[]],
	['046', bat,[]],
	['055', a, [
	'マンフロイ大司教・・・',
	'お許しを・・・',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
