from .params import *
scene_dir = [
	'17-vsユリウス/',
	'18-vsイシュタル/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : vsユリウス'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['', a, [
	'vsユリウス',
	]],
	
	['006', bat,[]],
	['005', a, [
	'フフフ・・・イシュタルよ、',
	'私の勝ちだな',
	]],
	['016', bat,[]],
	['026', bat,[]],
	['036', bat,[]],
	['046', bat,[]],
	['056', bat,[]],
	['096', bat,[]],
	['105', a, [
	'遊びは終わりだ、帰るぞ',
	]],
	['070', fld,[]],
	['080', fld,[]],
	
	['', a, [
	'ユリウスが勝利',
	]],
	['063', a, [
	'ふっ、イシュタル、わたしの勝ちだな',
	]],
	['064', a, [
	'さすがユリウスさま、お見事です',
	]],
	
	['', a, [
	'二人を倒さず、ミレトス城制圧',
	]],
	['113', a, [
	'遊びは終わりだ、帰るぞイシュタル',
	]],
	['114', a, [
	'はい、ユリウスさま',
	]],
	
	['改ページ', -1, ['']],
	
	['', a, [
	'vsイシュタル',
	]],
	
	['126', bat,[]],
	['125', a, [
	'ユリウスさま、',
	'わたしの勝ちのようですね',
	]],
	['196', bat,[]],
	['206', bat,[]],
	['136', bat,[]],
	['146', bat,[]],
	['155', a, [
	'え？　なぜ・・・',
	]],
	['163', a, [
	'おまえの負けだな、さあ、帰るぞ！',
	]],
	
	['170', fld,[]],
	['180', fld,[]],

	['', a, [
	'イシュタルが勝利',
	]],
	['213', a, [
	'ふふっ、ユリウスさま、わたしの勝ちですね',
	]],
	['214', a, [
	'ふっ・・・イシュタルめ、なかなかやる',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
