from .params import *
scene_dir = [
	'09-vsヒルダ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsヒルダ'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['', a, [
	'vsヒルダ',
	]],
	['126', bat,[]],
	['125', a, [
	'わが父、わが夫、わが息子のうらみ',
	'・・・思い知れ！！',
	]],
	
	['', a, [
	'セリスvsヒルダ',
	]],
	['006', bat,[]],
	['005', a, [
	'お前はセリスだね！',
	
	'くっ・・・お前のためにブルームやイシュトーは・・・',
	'許さないよ！！',
	]],
	['026', bat,[]],
	['036', bat,[]],
	['046', bat,[]],
	['056', bat,[]],
	['066', bat,[]],
	['075', a, [
	'くうっ・・・なんてことだい・・・',
	'ここはひとまず退却するか・・・',
	
	'',
	'(ボルガノン)',
	]],
	['090', fld,[]],
	['100', fld,[]],
	['110', fld,[]],
	
	['', a, [
	'ティニーvsヒルダ',
	]],
	['133', a, [
	'ほほほ、これはティニーじゃないか',
	'やっぱりあの女の娘だね',
	'恩知らずなところはそっくりだ',
	]],
	['134', a, [
	'ヒルダ・・・あなたのためにお母様は！',
	]],
	['143', a, [
	'ああ、あの女は目障りだったからね',
	'いじめて、いじめて、いじめ抜いてやった',
	'ほほほ、あの頃は楽しかったねぇ',
	]],
	['144', a, [
	'！・・・許せない・・・',
	]],
	['153', a, [
	'一人前の口をきくんじゃないよ！',
	'お前のような小娘に何ができる',
	
	'お前もあの女と同じように、',
	'このあたしが地獄に送ってやるよ！！！',
	]],
	
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
