from .params import *
scene_dir = [
	'19-vsザガム/',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : vsザガム'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['', a, [
	'vsザガム',
	]],
	
	['006', bat,[]],
	['005', a, [
	'ふふふ・・・',
	'おのれの不幸を呪うのだな・・・',
	]],
	['016', bat,[]],
	['026', bat,[]],
	['036', bat,[]],
	['046', bat,[]],
	['056', bat,[]],
	['066', bat,[]],
	['075', a, [
	'マンフロイ大司教、お許しあれ・・・',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
