from .params import *
scene_dir = [
	'01-子供狩り/',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : ユリウスの子供狩り'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['', a, [
	'ユリウスの子供狩り',
	]],
	
	['000', fld,[]],
	
	['011', a, [
	'イシュタル、計画は進んでいるか？',
	]],
	['012', a, [
	'はっ、着々と・・・',
	]],
	['021', a, [
	'ふっ・・・暗黒神へのいけにえか',
	'',
	'住民どもは恐れているだろうな',
	]],
	['022', a, [
	'自分の子供が火に焼かれると知って、',
	'嘆かぬ親はおりませぬ',
	'特に母親の悲しみは・・・',
	]],
	['031', a, [
	'ふふっ・・・それでいい',
	'奴らに絶望を与えよ',
	'',

	'生きる希望を失った人間は、',
	'人形のようにおとなしくなる',
	'ロプト帝国の奴隷にちょうど良い',
	]],
	['042', a, [
	'それで集めた子供はどういたします？',
	'すでにこの城に入りきらないほどの数になっております',
	]],
	['051', a, [
	'そのつど、帝都バーハラに送るのだ',
	'子供達は私のもとで教育する',

	'友であろうと、兄弟であろうと、',
	'たがいを憎ませ、殺しあわせる',

	'生き残ったものだけが、',
	'ロプトウスの忠実なしもべとして、',
	'帝国の新しい領民となるのだ',
	]],
	['072', a, [
	'しかしユリウス様',
	'アルヴィス皇帝はいかがいたします？',

	'皇帝は子供狩りだけは、',
	'なにがあっても許さぬと・・・',
	]],
	['091', a, [
	'父上？',
	'ふふふ・・・心配はいらぬ',
	'私にまかせておけ・・・',
	]],
	['101', a, [
	'',
	]],
	['102', a, [
	'ユリウス様・・・',
	]],
	
	['', a, [
	'ヒルダの叱咤',
	]],
	
	['111', a, [
	'イシュタル、ユリウス殿下は？',
	]],
	['112', a, [
	'あ、母上・・・',
	'皇子はバーハラにお帰りになりました',
	]],
	['121', a, [
	'そうか・・・しかしどうなのかねぇ',
	'殿下はおまえをお好きなようだが、',
	'お妃にして下さるのかね',
	]],
	['122', a, [
	'それは・・・',
	]],
	['131', a, [
	'しっかりおしよ',

	'我がフリージ家はグランベルの名門',
	'それにあたしも皇帝家と同じヴェルトマーの出身だ',
	
	'殿下のお相手として、',
	'おまえ以上に相応しい者はいないんだよ',
	]],
	['152', a, [
	'はい・・・',
	]],
	['161', a, [
	'とにかくイシュタル',
	'我が夫ブルームも息子イシュトーも反乱軍に討たれ、',
	
	'アルスターの領地は敵に奪われた',
	'セリスは父親ともども、',
	'我がフリージ家の憎い仇なんだ',
	
	'あたしはこのクロノス城で反乱軍を迎え討つが、',

	'おまえはミレトスに帰って、',
	'集めた子供を帝都に送る手配をおし',
	]],
	['192', a, [
	'はい、母上・・・',
	]],
	
	['', a, [
	'冷酷なヒルダ',
	]],
	
	['202', a, [
	'ヒルダ様、魔道士の配置は終わりました',

	'しかし、',
	'混乱にまぎれて一部の子供が城外へ逃げたようです',
	'いかがいたしましょう？',
	]],
	['221', a, [
	'なんだって！？',
	'おろかなことを・・・ふん、まあいいさ',
	'見せしめに、みんな殺すんだよ',
	
	'ラドス城のリデール将軍に、',
	'逃げた子供の処刑をお命じ',
	]],
	
	['', a, [
	'ラドス城からの追討軍',
	]],
	
	['240', fld,[]],
	
	['253', a, [
	'ねえ、どこに逃げればいいの？',
	]],
	['254', a, [
	'そんなのわかんないよ',
	]],
	['263', a, [
	'でも、それじゃわたしたち・・・',
	]],
	['264', a, [
	'泣くなよ・・・大丈夫だよ',
	'聖戦士さまが、ぼくたちを助けてくれる',
	'そう信じるんだよ',
	]],
	['273', a, [
	'うん・・・そうよね、聖戦士さま・・・',
	'きっと、きてくれるよね・・・きっと・・・',
	]],
	
	['280', fld,[]],
	
	['291', a, [
	'リデール将軍',
	'クロノスのヒルダ様から出撃のご命令だ',
	]],
	['292', a, [
	'そうか、それはありがたいな',
	'こんな仕事は、われら武人のやることではない',
	
	'子供狩りは、もうあきあきだ',
	'後は貴様らの好きにしろ',
	]],
	['311', a, [
	'それは残念だったな',
	'今度の仕事は逃げた子供の処刑らしいぞ',
	]],
	['312', a, [
	'な、なんだと・・・',
	]],
	['321', a, [
	'おまえも帝国の軍人なら、',
	'命令には従うしかあるまい',

	'それとも、アルヴィス皇帝を裏切るつもりか',
	]],
	['332', a, [
	'・・・いや・・・それはできない',
	'アルヴィス陛下だけは裏切れぬ・・・',
	'わかった・・・やむをえぬ・・・',
	]],
	['342', a, [
	'',
	]],
	['341', a, [
	'ふっ・・・軍人とは愚かなものよ',
	]],
	
	#['350', fld,[]],
	['360', fld,[]],
	
	['', a, [
	'ユリア失踪',
	]],
	
	['370', fld,[]],
	
	['381', a, [
	'ユリア皇女、探したぞ・・・',
	]],
	['382', a, [
	'え？　あなたは誰・・・？',
	]],
	['391', a, [
	'くくく・・・',
	'ショックで記憶までなくしたようだな',
	'まあいい、わしとともに来い',
	]],
	['392', a, [
	'イヤです、離して下さい！',
	]],
	['401', a, [
	'ふふふ・・・わしにあらがうことは無駄じゃ',
	'諦めよ',
	]],
	['402', a, [
	'ああ・・・たすけて・・・セリス様・・・',
	]],
	
	['', a, [
	'セリス軍出撃',
	]],
	
	['411', a, [
	'セリス、クロノスから子供たちが逃げ出したようだ',
	'このままでは殺されてしまうぞ',
	]],
	['412', a, [
	'子供たちが！？',
	'わかった、すぐに出撃しよう',
	'一人でも多く助けるんだ',
	]],
	['421', a, [
	'だがセリス',
	'ユリアの姿が見えないのだ',
	'さっきから探しているのだが・・・',
	]],
	['422', a, [
	'ユリアがいない？　どうしてなんだ！！',
	'まさか・・・',
	]],
	['431', a, [
	'そうだ',
	'敵に捕らわれたとしか考えられない',
	
	'奴等がなぜユリアを狙うのかは、',
	'わからないがな・・・',
	]],
	['442', a, [
	'くっ・・・ユリア',
	'待っていてくれ、必ず助けに行く！',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
