from .params import *
scene_dir = [
	'26-アルヴィス撃破後/',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase4 : アルヴィス撃破後'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['', a, [
	'セリスでアルヴィスを撃破',
	]],
	
	['003', a, [
	'セリス・・・、セリス・・・・',
	]],
	['004', a, [
	'だ、誰だ？　ぼくの名前を呼ぶのは？',
	]],
	['013', a, [
	'・・・セリス・・・・・大きくなって・・・',
	]],
	['014', a, [
	'も、もしかして母上！？',
	'母上なのですか',
	]],
	['023', a, [
	'・・・こんなに立派に育って・・・',
	'レヴィン様に感謝しなくては・・・・・',

	'・・・セリス、仲間を、お友達を大切にね',
	'・・・いつでも感謝の気持ちを忘れないように・・・・',
	]],
	['034', a, [
	'・・・は、はい・・・・母上！',
	'',
	'私はついにアルヴィス皇帝を倒しました！',
	'父上の無念をはらしたのです！',
	]],
	['043', a, [
	'そう・・・・',
	'じゃあユリウスとユリアは・・・・',
	]],
	['044', a, [
	'ユリウスとユリア！？',
	'母上は、どうして二人をご存知なのですか？',
	]],
	['053', a, [
	'・・・・・・',
	]],
	['054', a, [
	'母上・・・？',
	]],
	['063', a, [
	'セリス',
	]],
	['064', a, [
	'あなたは？',
	'まさか・・・父上！？',
	]],
	['073', a, [
	'セリス、思い上がってはならぬ',
	'アルヴィスが倒れたのは、おまえの力ではない・・・',
	]],
	['074', a, [
	'えっ、父上・・・それはいったい！？',
	]],
	['083', a, [
	'セリスよ、人の悲しみを知れ',
	'真実は一つだけではない',

	'それがわからなければ、',
	'この戦いは無意味となろう・・・',
	]],
	['103', a, [
	'',
	]],
	['104', a, [
	'ち、父上！　待って下さい！',
	]],
	['113', a, [
	'・・・からだには気をつけるのですよ・・・',
	]],
	['114', a, [
	'母上・・・',
	
	'',
	'(ライブのうでわ)',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
