from .params import *
scene_dir = [
	'25-vsアルヴィス/',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase4 : vsアルヴィス'

a = 1
fld = 0.5
bat = 0.75

scene = [
	
	['', a, [
	'vsアルヴィス',
	]],
	
	['026', bat,[]],
	['025', a, [
	'ふっ、哀れなものどもよ',
	'わが地獄の炎に灼かれるのだ！',
	]],
	
	['036', bat,[]],
	['046', bat,[]],
	['056', bat,[]],
	['066', bat,[]],
	['076', bat,[]],
	['086', bat,[]],
	['096', bat,[]],
	['105', a, [
	'・・・ディアドラ・・・ユリア・・・',
	]],

	['', a, [
	'セリスvsアルヴィス',
	]],
	
	['003', a, [
	'アルヴィス皇帝！',
	'あなたは何故私の父を・・・',
	]],
	['004', a, [
	'セリスか・・・よく来たな',
	'その勇気は褒めてやろう',
	
	'だが、お前も我が炎に灼かれる運命にある',
	'親子共々、哀れなものよ・・・',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
