from .params import *
scene_dir = [
	#'81-セリス軍',
	'81a-セリス軍',
	
	#'88-ユリウス',
	'89-ミレトス軍',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

#title = 'Phase3 : vsミレトス軍' 
title = 'Phase3(平民) : vsミレトス軍' 

persons = {
	'セリス'  : '00',
	'ザガム'  : '23',
}

organization = {
	'左' : {
		'名' : 'セリス軍(23)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10,11,12]],
			['', [13,14,15,16]],
			['', [17,18,19,20]],
			['', [21,22]],
		],
	},
	'右' : {
		'名' : 'ザガム(25)',
		'指揮官' : persons['ザガム'],
		'編成' : [
			['ダークマージ(フェンリル)(4)', [24,25,26,27]],
			['ダークマージ(ヨツムンガンド)(4)', [28,29,30,31]],
			['ダークマージ(ヘル)(4)', [32,33,34,35]],
			['ダークマージ(スリープの杖)(4)', [36,37,38,39]],
			['ダークマージ(リブローの杖)(2)', [40,41]],
			['スナイパー(2)', [42,43]],
			['フォーレスト(2)', [44,45]],
			['ウォーリア(2)', [46,47]],
		],
	},
}
