from .params import *
scene_dir = [
	#'81-セリス軍',
	'81a-セリス軍',
	#'87-子供',
	
	#'82-ヒルダ',
	#'83-クロノス軍',
	#'86-ミレトス軍',
	
	#'85-リデール軍',
	'84-モリガン軍',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

#title = 'Phase2 : vsモリガン軍' 
title = 'Phase2(平民) : vsモリガン軍' 

persons = {
	'セリス'  : '00',
	'モリガン'  : '23',
}

organization = {
	'左' : {
		'名' : 'セリス軍(23)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10,11,12]],
			['', [13,14,15,16]],
			['', [17,18,19,20]],
			['', [21,22]],
		],
	},
	'右' : {
		'名' : 'モリガン軍(4)',
		'指揮官' : persons['モリガン'],
		'編成' : [
			['ダークマージ(ヘル)(3)', [24,25,26]],
		],
	},
}
