from .params import *
scene_dir = [
	'81-セリス軍',
	#'81a-セリス軍',
	
	'90-ロートリッター',
	'91-ロートリッター',
	'92-ロートリッター',
	'93-ロートリッター',
	#'94-シアルフィ軍',
	#'95-パルマーク一行',
	
	
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase4 : vsロートリッター' 
#title = 'Phase4(平民) : vsロートリッター' 

persons = {
	'セリス'  : '00',
	'アルヴィス'  : '23',
}

organization = {
	'左' : {
		'名' : 'セリス軍(23)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10,11,12]],
			['', [13,14,15,16]],
			['', [17,18,19,20]],
			['', [21,22]],
		],
	},
	'右' : {
		'名' : 'アルヴィス(31)',
		'指揮官' : persons['アルヴィス'],
		'編成' : [
			['ハイプリースト(1)', [24]],
			['ファイアマージ(5)', [25,26,27,28,29]],
			['マージナイト(隊長)', [30]],
			['デューク,グレート,ボウナイト(3,2,2)', [31,32,33,34,35,36,37]],
			['ビショップ(隊長)', [38]],
			['プリースト,ファイアマージ(3,4)', [39,40,41,42,43,44,45]],
			['バロン(隊長)', [46]],
			['アーマー,ボウアーマー(3,4)', [47,48,49,50,51,52,53]],
			
		],
	},
}
