from .params import *
scene_dir = [
	'81-セリス軍',
	#'81a-セリス軍',
	#'87-子供',
	
	'82-ヒルダ',
	'83-クロノス軍',
	'86-ミレトス軍',
	
	#'85-リデール軍',
	#'84-モリガン軍',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsヒルダ軍' 
#title = 'Phase1(平民) : vsヒルダ軍' 

persons = {
	'セリス'  : '00',
	'ヒルダ'  : '23',
}

organization = {
	'左' : {
		'名' : 'セリス軍(23)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10,11,12]],
			['', [13,14,15,16]],
			['', [17,18,19,20]],
			['', [21,22]],
		],
	},
	'右' : {
		'名' : 'ヒルダ軍(21)',
		'指揮官' : persons['ヒルダ'],
		'編成' : [
			['ダークビショップ(1)', [24]],
			['フォーレスト(2)', [25,26]],
			['スナイパー(2)', [27,28]],
			['ダークマージ(ヘル)(2)', [29,30]],
			['ダークマージ(ヨルムンガンド)(4)', [31,32,33,34]],
			['ダークマージ(スリープの杖)(2)', [35,37]],
			['ダークマージ(フェンリル)(2)', [36,38]],
			['パイレーツ(5)', [39,40,41,42,43]],
		],
	},
}
