from .params import *
scene_dir = [
	'81-セリス軍',
	#'81a-セリス軍',
	
	'88-ユリウス',
	#'89-ミレトス軍',
	
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : vsユリウス' 
#title = 'Phase3(平民) : vsユリウス' 

persons = {
	'セリス'  : '00',
	'ユリウス'  : '23',
}

organization = {
	'左' : {
		'名' : 'セリス軍(23)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10,11,12]],
			['', [13,14,15,16]],
			['', [17,18,19,20]],
			['', [21,22]],
		],
	},
	'右' : {
		'名' : 'ユリウス(2)',
		'指揮官' : persons['ユリウス'],
		'編成' : [
			['イシュタル', [24]],
		],
	},
}
