from .params import *
scene_dir = [
	#'81-セリス軍',
	#'81a-セリス軍',
	'87-子供',
	
	#'82-ヒルダ',
	#'83-クロノス軍',
	#'86-ミレトス軍',
	
	'85-リデール軍',
	#'84-モリガン軍',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : 子供vsリデール軍' 


persons = {
	'子供'  : '00',
	'リデール'  : '06',
}

organization = {
	'左' : {
		'名' : '子供(6)',
		'指揮官' : persons['子供'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5]],
		],
	},
	'右' : {
		'名' : 'リデール軍(15)',
		'指揮官' : persons['リデール'],
		'編成' : [
			['トルバドール(2)', [7,8]],
			['ボウナイト(3)', [9,10,11]],
			['マージナイト(3)', [12,13,14]],
			['デュークナイト(3)', [15,16,17]],
			['グレートナイト(3)', [18,19,20]],
		],
	},
}
