from .params import *
scene_dir = [
	'00-プロローグ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]
#files = []

org_im = [15]

title = 'プロローグ'
a = 0.5

scene = [ 
	
	
	['00', a, [
	'トラキア城を制圧したセリスは、',
	'一路、グランベルを目指して進軍した',
	]],
	['01', a, [
	'帝国の南、ミレトス地方に、',
	'到着したセリスたちが見たものは、',
	
	'かつて、貿易で巨大な富を築き、',
	'あらゆる勢力から自由だった都市群が、',
	]],
	['03', a, [
	'帝国と暗黒教団の支配によって、',
	'死に絶えようとする姿だった',
	]],
	['04', a, [
	'クロノス城のヒルダ女王は、',
	
	'その狂気とも思える残虐さで、',
	'多くの市民を死に追いやり、',
	]],
	['06', a, [
	'ミレトス城のマンフロイ大司教は、',
	'ラドス城のモリガン司教に命じて、',
	
	'容赦のない子供狩りを行っていた',
	'',
	
	'富も、自由も、希望も、命さえも、',
	'人々の手から失われていった',
	
	'暗黒教団の儀式の生贄として、',
	'次々と殺されていく人々を、',
	
	'セリスは見過ごすことなどできなかった',
	]],
	['11', a, [
	'激しい戦いの末に帝国軍を追い払い、',
	'自由都市ペルルークを救った解放軍を、',
	
	'市民達は歓呼をもって迎えた',
	'',
	
	'失われつつあったミレトスの希望は、',
	'解放軍の到来によって、',
	
	'ようやく、',
	'息を吹き返そうとしていたのである',
	]],
	
	['15', a, []],
	
	]


