

#村1
phrase1 =[
	'ああ、これはよくおいで下さいました',
	'これでこの村も救れます',
	'この金は村人達から集めたもの',
	'わずかですが戦いのお役に立てて下さい',
	'他の村も助ける事ができれば',
	'きっとあなた達に協力すると思いますよ',
	'(4500ゴールド)',
	]


#村2
phrase2 = [
	'よくききなされ、剣は斧には強く',
	'斧は槍には強く、槍は剣に強い',
	'この組み合わせを、よく考えて戦いなされよ',
	'そして、もし傷ついたら教会へ行くとよい',
	'少し休むだけでたちまち完治するぞ',
	'ただし、タダというわけにはいかぬ',
	'１ＨＰにつき５ゴールド必要じゃ',
	'(5000ゴールド)',
	]


#村3
phrase3 = [
	'この地を治めるシアルフィ公爵家は',
	'代々、剣の使い手として有名なんだよ',
	'なにしろ、光神バルドの血をひいておられるからね',
	'ヴェルダンの蛮族なんて',
	'バイロン様の聖剣ティルフィングがあれば',
	'あっという間にやっつけられるのにねぇ',
	'(3000ゴールド)',
	]

#村4
phrase4 = [
	'このユングヴィは、弓に長けた家柄',
	'公爵家の方々は、弓神ウルの子孫じゃ',
	'リング公爵には双子の姉妹と',
	'その下に男の子がいたが',
	'双子の姉の方は幼いときに',
	'海賊にさらわれて今も行方不明だという',
	'エーディン様の弟君のアンドレイ様は',
	'父君リング公爵とともに遠征中だが',
	'あまりよい噂は聞かんのぉ',
	'親子の関係も冷めているらしいぞ・・・',
	'(3000ゴールド)',
	]

#村5
phrase5 = [
	'おおっ、やっと助けにきてくれたのかえ',
	'もうだめかと思っとったぞ',
	'お礼にこのリングをそなたにやろう',
	'これはスピードリングといってな',
	'身につけるだけで素早さがあがる',
	'不思議な腕輪なのじゃ',
	'ほれ、つけてごらん、これで敵の攻撃も',
	'当たりにくくなる筈じゃよ',
	'スピードリング',
	'(2500ゴールド)',
	]

