base_dir = '/storage/43E3-332A/others/test/work/ROM/SNES/ファイアーエムブレム 聖戦の系譜 (J)/'
#base_dir = './test/'
chaper_dir = '00-序章-聖騎士誕生/'
ivent_dir = '03-エーディン受難/'

title = 'Phase1 : ユングヴィ落城'

dirs = [
	base_dir + chaper_dir + ivent_dir,
]

#files = [
#]

a = 1
fld = 0.5
bat = 0.75

scene = [
	['003', a, [
	'ああっ、ミデェール・・・',
	]],
	['004', a, [
	'おおっ、これは上玉だな',
	'ユングヴィの姫君か・・・ふふ・・・',
	'よし、俺はこの女を連れて国に帰る',
	'後のことは、',
	'お前とゲラルドの二人でなんとかしろ',
	]],
	['023', a, [
	'へぇ・・・',
	]],
	['004', a, [
	'心配するな',
	'弟のキンボイスの軍と一緒に戻る',
	'そうすりゃバーハラまで',
	'攻め上がってやるぜ、なんてったって',
	'この国には今、軍隊はいないんだ',
	'俺達のしたい放題だぜ',
	]],
	['023', a, [
	'へい、わかりやした、お任せを！',
	]],
	['060', fld,[]],
	['070', fld,[]],
	['083', a, [
	'てめぇ、グズグズするんじゃねぇ！',
	'さっさと歩くんだ！！',
	]],
	['084', a, [
	'・・・・・・',
	]],
	['090', fld,[]],
	['100', fld,[]],
	['113', a, [
	'グランベルの連中が入ってこねぇように',
	'橋を落としておけ！',
	]],
	['114', a, [
	'へい、わかりました',
	]],
	['120', fld,[]],
	['133', a, [
	'おい、ゲラルド',
	'俺はマーファ城に帰る',
	'この城はお前に任すから、しっかり守れよ',
	]],
	['134', a, [
	'へい、分かりました',
	'しかしガンドルフ王子、',
	'その女は誰なんです？',
	]],
	['143', a, [
	'俺の戦利品よ',
	'マーファに連れていって妻にする',
	'どうだ、いい女だろう',
	]],
	['144', a, [
	'へえ、',
	'思わずよだれが出そうになりますぜ',
	]],
	['153', a, [
	'バカめ、物欲しそうな顔をするな',
	'グランベルを占領したら',
	'お前にも好きなだけくれてやる',
	'それまでは我慢しろ',
	]],
	['164', a, [
	'あなた達はケダモノです',
	'・・・神よ、どうかこの者たちに',
	'人間としての心を・・・',
	]],
	
	['173', a, [
	'何をブツブツ言ってやがるんでぇ',
	'さあ行くぜ！グズグズするな！！',
	]],
	['180', fld,[]],
	['194', a, [
	'行け、野郎ども！',
	'次はシアルフィだ！',
	'ついでに村のお宝も巻き上げてこい！',
	]],
]
