from .params import *
scene_dir = [
	'24-vsゲラルド/',
	'25-ミデェールvsゲラルド/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]
#files = []

title = 'Phase2 : vsゲラルド'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['006', bat,[]],
	['005', a, [
	'グランベルの犬め',
	'くたばれ！',
	]],
	['016', bat,[]],
	['026', bat,[]],
	['036', bat,[]],
	['035', a, [
	'残念だったな・・・',
	'あの女はここにはいねぇよ',
	'今頃はガンドルフ王子に・・・',
	]],
	['046', bat,[]],
	
	['', a, [
	'ミデェールvsゲラルド',
	]],
	['053', a, [
	'ま、待て！',
	'飛び道具とは卑怯だぞ！',
	]],
	['054', a, [
	'だまれ！エーディン様をどこへやった！',
	'早く返せ！！',
	]],
]
