base_dir = '/storage/43E3-332A/others/test/work/ROM/SNES/ファイアーエムブレム 聖戦の系譜 (J)/'
#base_dir = './test/'
chaper_dir = '00-序章-聖騎士誕生/'

ivent_dir = '71-村解放/'
ivent_dir2 = '72-村解放/'
ivent_dir3 = '73-村解放/'
ivent_dir4 = '74-村解放/'
ivent_dir5 = '75-村解放/'

title = 'Phase2 : 村解放'

dirs = [
	base_dir + chaper_dir + ivent_dir,
	base_dir + chaper_dir + ivent_dir2,
	base_dir + chaper_dir + ivent_dir3,
	base_dir + chaper_dir + ivent_dir4,
	base_dir + chaper_dir + ivent_dir5,
]

#files = [
#]

a = 1
fld = 0.5
bat = 0.75

scene = [
	['', a, [
	'村1',
	]],
	['004', a, [
	'ああ、これはよくおいで下さいました',
	'これでこの村も救れます',
	'この金は村人達から集めたもの',
	'わずかですが戦いのお役に立てて下さい',
	'他の村も助ける事ができれば',
	'きっとあなた達に協力すると思いますよ',
	'(4500ゴールド)',
	]],
	
	['', a, [
	'村2',
	]],
	['044', a, [
	'よくききなされ、剣は斧には強く',
	'斧は槍には強く、槍は剣に強い',
	'この組み合わせを、よく考えて戦いなされよ',
	'そして、もし傷ついたら教会へ行くとよい',
	'少し休むだけでたちまち完治するぞ',
	'ただし、タダというわけにはいかぬ',
	'１ＨＰにつき５ゴールド必要じゃ',
	'(5000ゴールド)',
	]],
	
	['', a, [
	'村3',
	]],
	['094', a, [
	'この地を治めるシアルフィ公爵家は',
	'代々、剣の使い手として有名なんだよ',
	'なにしろ、光神バルドの血をひいておられるからね',
	'ヴェルダンの蛮族なんて',
	'バイロン様の聖剣ティルフィングがあれば',
	'あっという間にやっつけられるのにねぇ',
	'(3000ゴールド)',
	]],
	
	['', a, [
	'村4',
	]],
	['134', a, [
	'このユングヴィは、弓に長けた家柄',
	'公爵家の方々は、弓神ウルの子孫じゃ',
	'リング公爵には双子の姉妹と',
	'その下に男の子がいたが',
	'双子の姉の方は幼いときに',
	'海賊にさらわれて今も行方不明だという',
	'エーディン様の弟君のアンドレイ様は',
	'父君リング公爵とともに遠征中だが',
	'あまりよい噂は聞かんのぉ',
	'親子の関係も冷めているらしいぞ・・・',
	'(3000ゴールド)',
	]],
	
	['', a, [
	'村5',
	]],
	['194', a, [
	'おおっ、やっと助けにきてくれたのかえ',
	'もうだめかと思っとったぞ',
	'お礼にこのリングをそなたにやろう',
	'これはスピードリングといってな',
	'身につけるだけで素早さがあがる',
	'不思議な腕輪なのじゃ',
	'ほれ、つけてごらん、これで敵の攻撃も',
	'当たりにくくなる筈じゃよ',
	'(スピードリング)',
	'(2500ゴールド)',
	]],
]
