from .params import *
ivent_dir = '02-ユングウィ落城/'

title = 'Phase1 : ミデェールvsガンドルフ'

dirs = [
	base_dir + chaper_dir + ivent_dir,
]

#files = [
#]

a = 1
fld = 0.5
bat = 0.75

scene = [
	['004', a, [
	'てめぇら、こんなちっぽけな城に',
	'いつまでかかってやがるんでぇ',
	'しゃあねぇな・・・俺がやってやる',
	]],
	['016', bat,[]],
	['015', a, [
	'ふふふ・・・あんちゃんよぉ',
	'一人でよく頑張ったな',
	'だがそれもこれまでだ、くらえ！',
	]],
	['026', bat,[]],
	['036', bat,[]],
	['046', bat,[]],
	['045', a, [
	'くっ・・・エーディン様',
	'・・・お許し下さい',
	]],
	['056', bat,[]],
]
