from .params import *
scene_dir = [
	'81-シグルド軍',
	'93-エバンズ軍(ゲラルド)/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]
#files = []

title = 'Phase2 : vsゲラルド' 

persons = {
	'シグルド'  : '00',
	'ゲラルド'  : '10',
}

organization = {
	'左' : {
		'名' : 'シグルド軍(10)',
		'指揮官' : persons['シグルド'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9]],
		],
	},
	'右' : {
		'名' : 'ゲラルド軍(16)',
		'指揮官' : persons['ゲラルド'],
		'編成' : [
			['バーバリアン(10)', [16,17,18,19,20,21,22,23]],
			['', [24,25]],
			['ハンター(5)', [11,12,13,24,15]],
		],
	},
}
