from .params import *
scene_dir = [
	'00-プロローグ/',
	'00-プロローグ追加画像/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]
#files = []

out_file = '序章-聖騎士誕生-プロローグ.png'

TEST_RUN_FIRST = False
TEST_RUN = False
RUN = True

comp = [
		[26, (0,0)],
		[1, (176,112)],
		[26, (0,0)],
		[40, (96, 176)],
		[28,(-16,208)],
		[18, (384, 0)],
		
		[41, (295, 9)],
		[42, (310, 0)],
		[43, (384, 0)],
		
		[45, (367, 17)],
		[46, (347, 37)],
		[47, (285, 99)],
		[48, (258, 112)],
		
		[49, (55, 0)],
		[51, (0, 26)],
		[53, (0, 77)],
	]

