from .params import *
scene_dir = [
	'11-vsクトゥーゾフ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsクトゥーゾフ'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['', a, [
	'フェンリル発見',
	]],
	['001', a, [
	'クトゥーゾフ様、',
	'フェンリルの魔道書がみつかりました',
	]],
	['002', a, [
	'なに？　やっとみつけたか！',
	'ふふふ・・・これで奴等もおしまいじゃ',

	'フェンリルの恐ろしさ、とくと思い知るがよいわ',
	]],
	
	['改ページ', -1, ['']],
	
	['', a, [
	'vsクトゥーゾフ',
	]],
	['026', bat,[]],
	
	['025', a, [
	'反乱軍め・・・',
	'神聖なイード神殿を汚しおって！',
	
	'おのれ、暗黒魔法でほおむりさってくれるわ！',
	]],
	
	['046', bat,[]],
	['056', bat,[]],
	['066', bat,[]],
	['076', bat,[]],
	
	['085', a, [
	'ロプト帝国に・・・',
	'栄光あれ・・・',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
