from .params import *
scene_dir = [
	'35-vsジャバロー/',
	'36-vsブラムセル/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : vsブラムセル'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['', a, [
	'vsジャバロー',
	]],
	
	['006', bat,[]],
	
	['005', a, [
	'フッ・・・これまでだな',
	'死ね！',
	]],
	
	['016', bat,[]],
	['026', bat,[]],
	['046', bat,[]],
	
	['055', a, [
	'くそっ・・・アレスめ・・・',
	]],
	
	['', a, [
	'アレスvsジャバロー',
	]],
	['033', a, [
	'アレス！この恩知らずめ！！',
	'ただではおかんぞ！！',
	]],
	['034', a, [
	'あんたには愛想が尽きた',
	'悪いが死んでもらう・・・',
	]],

	['改ページ', -1, ['']],
	
	['', a, [
	'vsブラムセル',
	]],
	
	['066', bat,[]],
	['065', a, [
	'なに！？　ジャバローめ',
	'しくじりおって',

	'ダーナはワシのものだ、',
	'誰にもわたさんぞ！',
	]],
	
	['086', bat,[]],
	#['116', bat,[]],
	
	['125', a, [
	'うう・・・',
	'ダーナはワシのものだ',
	'・・・ワシのものだ・・・',
	]],
	
	['改ページ', -1, ['']],
	
	['', a, [
	'アレスvsブラムセル',
	]],
	['093', a, [
	'なにっ、貴様はアレスか！？',
	'おのれ、裏切ったな！！',
	]],
	['094', a, [
	'ブラムセル！',
	'リーンを返せ！',
	]],
	['103', a, [
	'もう遅いわ！',
	'あの女は今頃・・・ふふふ・・・',
	]],
	['104', a, [
	'き、貴様！・・・許さん！！',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
