from .params import *
scene_dir = [
	'34-vs三姉妹/',
	'40-vsブルーム/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase4 : vsブルーム'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['', a, [
	'vs三姉妹',
	]],
	
	['006', bat,[]],
	
	['', a, [
	'vsヴァンパ',
	]],
	['125', a, [
	'くらえ！　エルファイアー！！',
	]],
	['136', bat,[]],
	
	['', a, [
	'vsフェトラ',
	]],
	['065', a, [
	'くらえ！　エルウインド！！',
	]],
	['086', bat,[]],
	
	['', a, [
	'vsエリウ',
	]],
	['005', a, [
	'くらえ！　エルサンダー！！',
	]],
	['116', bat,[]],
	
	['096', bat,[]],
	
	['025', a, [
	'ち、ここはひとまず退却だな',
	]],
	['030', fld,[]],
	['040', fld,[]],
	['050', fld,[]],
	
	['', a, [
	'トライアングルアタック',
	]],
	['140', fld,[]],
	['150', fld,[]],
	['160', fld,[]],
	['175', a, [
	'ヴァンパ、エリウ、いくわよ！',
	'トライアングルアタッーク！！',
	]],
	
	['改ページ', -1, ['']],
	
	['', a, [
	'vsブルーム',
	]],
	['206', bat,[]],
	
	['205', a, [
	'ふふふ・・・こわっぱどもめ',
	'このトールハンマーがあれば、',
	'貴様達など恐れはしない！',
	]],
	
	['216', bat,[]],
	['226', bat,[]],
	['236', bat,[]],
	['276', bat,[]],
	
	['285', a, [
	'くっ、なんということだ・・・',
	'やむをえん・・・ひとまずコノートに退却だ・・・',
	]],
	['290', fld,[]],
	
	['', a, [
	'ティニーvsブルーム',
	]],
	['243', a, [
	'お、お前はティニー！？',
	'わしを裏切るのか・・・',
	]],
	['244', a, [
	'ごめんなさい、伯父さま・・・',
	]],
	
	['', a, [
	'リーフvsブルーム',
	]],
	['253', a, [
	'ほほう、お前はキュアンの小せがれだな',
	'まだ生きておったか',
	]],
	['254', a, [
	'ブルーム王、我が民を苦しめた罪、',
	'その死をもって償ってもらうぞ',
	]],
	['263', a, [
	'ふんっ、バカめ！',
	'死ぬのはお前の方だ！！',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
