from .params import *
scene_dir = [
	'19-vsライザ/',
	'20-vsイシュトー/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : vsイシュトー'

a = 1
fld = 0.5
bat = 0.75

scene = [
	['', a, [
	'vsライザ',
	]],
	
	['006', bat,[]],
	
	['005', a, [
	'反乱軍か・・・残念だが、お前達の進軍もここまでだ',

	'このライザがいる限り、メルゲン城には行かせないよ',
	]],
	
	['026', bat,[]],
	['036', bat,[]],
	['046', bat,[]],
	
	['055', a, [
	'ああ、イシュトー様・・・',
	]],
	
	['改ページ', -1, ['']],
	
	['', a, [
	'vsイシュトー',
	]],
	
	['066', bat,[]],
	['065', a, [
	'フッ、よくここまでこれたな',
	'ほめてやろう',
	]],
	['', a, [
	'ライザ撃破後',
	]],
	['125', a, [
	'貴様ら・・・',
	'よくもライザを・・・',
	'ゆるさん！',
	]],
	
	['076', bat,[]],
	['086', bat,[]],
	
	#['136', bat,[]],
	#['146', bat,[]],
	
	['096', bat,[]],
	['105', a, [
	'ライザ・・・俺は・・・',
	
	'',
	'(トローン)',
	]],
	
	# 0 フィールド
	# 人物1,2(屋内)
	# 人物3,4(屋外)
	# 人物5(戦闘)
	# 6 戦闘
	#['003', a, [
	#'',
	#]],
	#['060', fld,[]],
	#['改ページ', -1, ['']],
	#['016', bat,[]],
]
