from .params import *
scene_dir = [
	'81-セリス軍',
	'81-セリス軍1',
	'81-セリス軍2',
	'89-アレス',
	'94-リーン',
	'93-ティニー軍',
	
	'87-ブラムセル軍',
	'88-ジャバロー軍',
	#'90-ブルーム軍',
	#'91-ブルーム軍',
	#'92-三姉妹',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase3 : vsブラムセル軍' 

persons = {
	'セリス'  : '00',
	'ブラムセル'  : '24',
}

organization = {
	'左' : {
		'名' : 'セリス軍(19)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10,11,12]],
			['', [13,14,15]],
			['登場後に加入', [16]],
			['ダーナ城にアレス入城時加入', [17]],
			#['アーサーと会話で加入', [18]],
		],
	},
	'右' : {
		'名' : 'ブラムセル軍(20)',
		'指揮官' : persons['ブラムセル'],
		'編成' : [
			['ソードファイター(3)', [25,26,27]],
			['ジャバロー', [28]],
			['アーチナイト(3)', [29,30,31]],
			['ソードファイター(4)', [32,33,34,35]],
			['フリーナイト(8)', [36,37,38,39,40,41,42,43]],
		],
	},
}
