from .params import *
scene_dir = [
	'81-セリス軍',
	'81-セリス軍1',
	'81-セリス軍2',
	'82-クトゥーゾフ軍',
	#'83-ブルーム軍',
	#'84-ダーナ軍',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1 : vsクトゥーゾフ軍' 

persons = {
	'セリス'  : '00',
	'クトゥーゾフ'  : '16',
}

organization = {
	'左' : {
		'名' : 'セリス軍(16)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10]],
			['イード城近辺', [11,12]],
			['レンスター城近辺', [13,14,15]],
		],
	},
	'右' : {
		'名' : 'クトゥーゾフ軍(20)',
		'指揮官' : persons['クトゥーゾフ'],
		'編成' : [
			['ダークマージ(15)', [17,18,19,20,21,22,23,24]],
			['', [25,26,27,28,29,30,35]],
			['ソードファイター(4)', [31,32,33,34]],
		],
	},
}
