from .params import *
scene_dir = [
	#'81a-セリス軍',
	#'81a-セリス軍1',
	'81a-セリス軍2',
	#'82-クトゥーゾフ軍',
	'83-ブルーム軍',
	#'84-ダーナ軍',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase1(平民) : リーフ軍vsブルーム軍' 

persons = {
	'セリス'  : '00',
	'ブルーム'  : '03',
}

organization = {
	'左' : {
		'名' : 'リーフ軍(3)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['ジャンヌ', [1]],
			['フィン', [2]],
		],
	},
	'右' : {
		'名' : 'ブルーム軍(18)',
		'指揮官' : persons['ブルーム'],
		'編成' : [
			['ジェネラル(3)', [4,5,6]],
			['隊長', [7]],
			['サンダーマージ(1)', [8]],
			['ソードアーマー(6)', [9,10,11,12,13,14]],
			['マウンテンシーフ(6)', [15,16,17,18,19,20]],
		],
	},
}
