from .params import *
scene_dir = [
	'81-セリス軍',
	'81-セリス軍1',
	'81-セリス軍2',
	'85-イシュトー軍',
	'86-ライザ軍',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase2 : vsイシュトー、ライザ軍' 

persons = {
	'セリス'  : '00',
	'イシュトー'  : '16',
}

organization = {
	'左' : {
		'名' : 'セリス軍(16)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10,11,12]],
			['', [13,14,15]],
		],
	},
	'右' : {
		'名' : 'イシュトー軍(22)',
		'指揮官' : persons['イシュトー'],
		'編成' : [
			['サンダーマージ(3)', [17,18,19]],
			['ライザ', [20]],
			['ロングアーチ(2)', [21,22]],
			['プリースト(2)', [23,24]],
			['サンダーマージ(5)', [25,26,27,28,29]],
			['ボウアーマー(2)', [30,31]],
			['アーマー(6)', [32,33,34,35,36,37]],
		],
	},
}
