from .params import *
scene_dir = [
	'81a-セリス軍',
	'81a-セリス軍1',
	'81a-セリス軍2',
	'89-アレス',
	'94a-レイリア',
	'93a-リンダ軍',
	
	#'87-ブラムセル軍',
	#'88-ジャバロー軍',
	'90-ブルーム軍',
	'91-ブルーム軍',
	'92-三姉妹',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]

files = [
]

title = 'Phase4(平民) : vsブルーム軍' 

persons = {
	'セリス'  : '00',
	'ブルーム'  : '24',
}

organization = {
	'左' : {
		'名' : 'セリス軍(19)',
		'指揮官' : persons['セリス'],
		'編成' : [
			['', [1,2,3,4]],
			['', [5,6,7,8]],
			['', [9,10,11,12]],
			['', [13,14,15]],
			['', [16,17]],
			['アミッドと会話で加入', [18]],
		],
	},
	'右' : {
		'名' : 'ブルーム軍(20)',
		'指揮官' : persons['ブルーム'],
		'編成' : [
			['ジェネラル(3)', [25,26,27]],
			['(隊長)', [28]],
			['サンダーマージ(1)', [29]],
			['ソードアーマー(6)', [30,31,32,33,34,35]],
			['ヴァンパ, フェトラ, エリウ', [36,37,38]],
			['リンダ', [18]],
			['サンダーマージ(5)', [19,20,21,22,23]],
		],
	},
}
