from .params import *
scene_dir = [
	'00-プロローグ/',
]
dirs = [ base_dir + chaper_dir + s for s in scene_dir]
#files = []

org_im = [17]

title = 'プロローグ'
a = 0.5

scene = [ 
	['00', a, [
	'セリス皇子率いる解放軍の活躍は、',
	'帝国の圧政に苦しむ人々を勇気づけ、',
	
	'各地で住民の反乱が相次いだ。',
	
	'だが、その多くは、',
	'まとまりのないまま簡単に撃破され、',
	
	'大勢の人々が帝国兵の犠牲となっていた。',
	]],
	['04', a, [
	'トラキア半島のレンスター王国では、',
	]],
	['05', a, [
	'キュアンの子、リーフ王子が、',
	'フィンに助けられて挙兵したが、',
	
	'ブルーム王の大軍の前に惨敗をきっし、',
	'敵地の中に孤立していた。',
	]],
	['07', a, [
	'イード砂漠を支配する神殿には、',
	'ロプト教団のクトゥーゾフ、',

	'',
	'オアシスの街ダーナには、',
	]],
	['09', a, [
	'商人上がりのブラムセルと',
	'傭兵隊長ジャバロー、',
	]],
	['10', a, [
	'メルゲン城にはイシュトー王子と',
	'有能なる女将軍ライザ、',
	]],
	['11', a, [
	'王都アルスターには',
	'レプトール公爵の息子ブルームと、',
	]],
	['12', a, [
	'その姪である、女魔道士ティニー',
	]],
	
	['', a, [
	'(平民)',
	]],
	['18', a, [
	'その姪である、女魔道士リンダ',
	]],
	
	['改ページ', -1, ['']],
	
	['13', a, [
	'そして、リボーの街では、',
	'セリスを始めとする',
	'イザーク解放軍の戦士達が、',
	
	'はるか彼方にあるレンスターの仲間を',
	'救うべく旅立とうとしていたのである。',
	
	'',
	'それぞれのむねに思いを秘めて',

	'今、セリスたちの新たなる戦いが',
	'始まろうとしていた。',
	]],
	
	['17', a, []],
	
	
]


